\begin{introduction}
<p>Orienta&#269;n&iacute; pl&aacute;ny budov jsou pom&#367;ckou zn&aacute;mou ji&#382; n&#283;kolik stalet&iacute;. Pom&aacute;haj&iacute; lidem v orientaci v nezn&aacute;m&eacute;m prost&#345;ed&iacute; a zd&#367;raz&#328;uj&iacute; z&aacute;kladn&iacute; vybaven&iacute;, nap&#345;. schodi&scaron;t&#283;, chodby, vstupy &#269;i toalety. Nez&#345;&iacute;dka t&eacute;&#382; obsahuj&iacute; ozna&#269;en&iacute; m&iacute;sta, kde se &#269;lov&#283;k na pl&aacute;nu zrovna nach&aacute;z&iacute;, co&#382; lze pova&#382;ovat za p&#345;edch&#367;dce modr&eacute; geoloka&#269;n&iacute; ikonky&nbsp;v dne&scaron;n&iacute;ch telefonech.</p>
<p>Dal&scaron;&iacute; p&#345;&iacute;pad je pl&aacute;nek nouzov&eacute;ho &uacute;niku z budovy, kter&yacute; zv&yacute;raz&#328;uje &scaron;ipkami trasu k nejbli&#382;&scaron;&iacute;mu v&yacute;chodu. Nap&#345;&iacute;klad p&#345;i &uacute;t&#283;ku p&#345;ed po&#382;&aacute;rem tak lid&eacute; z pl&aacute;nku vy&#269;tou, kter&yacute;m schodi&scaron;t&#283;m se vydat a kde odbo&#269;it. &nbsp;Pro n&aacute;s to&nbsp;je&nbsp;op&#283;t p&#283;kn&yacute; p&#345;edch&#367;dce&nbsp;indoor&nbsp;navigace a routov&aacute;n&iacute;.</p>
<p>S n&aacute;stupem smartphon&#367; v posledn&iacute;ch 10 letech za&#269;al nar&#367;stat v&yacute;znam mapov&yacute;ch aplikac&iacute;. Tyto v sob&#283; &#269;asto kombinuj&iacute; digit&aacute;ln&iacute; mapy se slu&#382;bami geolokace, geocodingu, routov&aacute;n&iacute; a mnohdy i navigace. Samotn&aacute; mapa pak m&#367;&#382;e nab&iacute;zet leteck&yacute; re&#382;im, &scaron;ikm&eacute; sn&iacute;mkov&aacute;n&iacute;, street view, t&eacute;matick&yacute; m&oacute;d pro cyklisty apod. Samoz&#345;ejmost&iacute; jsou pak business listingy s mo&#382;nost&iacute; recenzov&aacute;n&iacute;. </p>
<p>Mezi dal&scaron;&iacute; vlastnosti modern&iacute;ch aplikac&iacute; pat&#345;&iacute; hl&aacute;&scaron;en&iacute; polohy&nbsp;u&#382;ivatel&#367;, kter&eacute; je cennou informac&iacute; pro podnik&aacute;n&iacute;, zejm&eacute;na polohov&#283; c&iacute;lenou reklamu. Zji&scaron;&#357;ov&aacute;n&iacute;&nbsp;n&aacute;vyk&#367; lid&iacute; poskytuje mnoho nov&yacute;ch mo&#382;nost&iacute; v oblasti&nbsp;slu&#382;eb. Z&iacute;sk&aacute;v&aacute;n&iacute;m v&yacute;stup&#367; z polohov&yacute;ch dat se zab&yacute;v&aacute; nov&#283; vznikl&yacute; v&#283;dn&iacute; obor Location Intelligence, kter&yacute; samoz&#345;ejm&#283; vyu&#382;&iacute;v&aacute; principy zn&aacute;m&eacute; znalostn&iacute;mu in&#382;en&yacute;rstv&iacute;\footnote{anglicky Business Intelligence}.</p>
<p>Indoor mapy jsou dom&eacute;nou n&#283;kolika posledn&iacute;ch let. V roce 2012 s nimi p&#345;i&scaron;la na sc&eacute;nu spole&#269;nost Google<sup><a>[1]</a></sup>.&nbsp;O&nbsp;dva roky pozd&#283;ji nazna&#269;il v&yacute;voj Apple, na&#269;e&#382; mnoh&eacute; zpravodajsk&eacute; port&aacute;ly p&#345;edv&iacute;daly<sup><a>[2]</a></sup>, &#382;e indoor mapping bude &ldquo;p&#345;&iacute;&scaron;t&iacute; velk&aacute; v&#283;c&rdquo;\footnote{V origin&aacute;le: the next big thing}.</p>
<p>Indoor mapy a geolokace p&#345;edstavuj&iacute;&nbsp;velkou technologickou v&yacute;zvu pro sou&#269;asn&yacute; v&#283;k.</p>
<p>V na&scaron;&iacute;&nbsp;pr&aacute;ci se detailn&#283; zab&yacute;v&aacute;me problematikou indoor map, mo&#382;nostmi platformy OpenStreetMap\footnote{Str&aacute;nka projektu na <a>openstreetmap.org</a>, str&aacute;nka &#269;esk&eacute; komunity na <a>openstreetmap.cz</a>}&nbsp;a &uacute;pravou webov&eacute;ho editoru&nbsp;iD. </p>
<p>V prvn&iacute; kapitole uv&aacute;d&iacute;me definici probl&eacute;mu a shrnujeme p&#345;&iacute;stup sou&#269;asn&yacute;ch slu&#382;eb. Ve druh&eacute; se zam&#283;&#345;ujeme na slu&#382;bu OpenStreetMap (OSM) &ndash; jej&iacute; architekturu, dostupn&eacute; editory, dosavadn&iacute; p&#345;&iacute;stup k indoor a n&aacute;vrh vhodn&eacute; metodiky pro tvorbu. Ve t&#345;et&iacute; kapitole pak popisujeme architekturu editoru iD, proces n&aacute;vrhu u&#382;ivatelsk&eacute;ho rozhran&iacute; pro indoor a samotn&eacute; implementace. V posledn&iacute; kapitole pak shrnujeme v&yacute;sledky a uv&aacute;d&iacute;me mo&#382;n&aacute; vyu&#382;it&iacute; ve ve&#345;ejn&yacute;ch budov&aacute;ch v&#269;etn&#283; konkr&eacute;tn&iacute;ho p&#345;&iacute;kladu &#268;VUT.</p>
<p>V na&scaron;&iacute; pr&aacute;ci u&#382;&iacute;v&aacute;me terminologii zab&#283;hnutou v &#269;esk&eacute; komunit&#283; projektu OpenStreetMap.&nbsp;&#268;ten&aacute;&#345; by j&iacute; m&#283;l v&#283;novat pozornost, proto&#382;e v dal&scaron;&iacute;m textu j&iacute; &#269;etn&#283; vyu&#382;&iacute;v&aacute;me.</p>
<p>Terminologie u&#382;it&aacute; v t&eacute;to pr&aacute;ci:</p>

<ul>
<li>sou&#345;adnice - zem&#283;pisn&eacute; sou&#345;adnice, typicky ve form&aacute;tu WGS84&nbsp;(pokud nen&iacute; bl&iacute;&#382;e ur&#269;eno)</li>
<li>geolokace - zam&#283;&#345;en&iacute; polohy u&#382;ivatele, typicky pomoc&iacute; GPS</li>
<li>indoor geolokace - zam&#283;&#345;en&iacute; polohy u&#382;ivatele pomoc&iacute; jin&yacute;ch prost&#345;edk&#367; (viz kapitola 1.2.) </li>
<li>indoor mapy - mapy vnit&#345;k&#367; budov</li>
<li>routov&aacute;n&iacute; - nalezen&iacute; trasy mezi dv&#283;ma fyzick&yacute;mi body</li>
<li>geocoding - nalezen&iacute; sou&#345;adnic dle zadan&eacute; adresy (a reverzn&iacute; geocoding obr&aacute;cen&#283;)</li>
<li>navigace - proces ur&#269;en&iacute; polohy a sestaven&iacute; pokyn&#367; pro n&aacute;sledov&aacute;n&iacute; nalezen&eacute; trasy</li>
<li>business listing&nbsp;- z&aacute;znam obchodu v mapov&eacute; aplikaci, typicky v podob&#283; um&iacute;st&#283;n&eacute; ikonky na konkr&eacute;tn&iacute;ch sou&#345;adnic&iacute;ch v map&#283;</li>
<li>POI (point of interest) - bod z&aacute;jmu v map&#283;, nap&#345;. nemocnice, zast&aacute;vka MHD &#269;i business listing</li>
<li>street view&nbsp;&ndash; panoramatick&eacute; fotografie v uli&#269;n&iacute; &uacute;rovni</li>

</ul>

<p>\end{introduction}</p>



<hr>
<h1>1. Problematika indoor map</h1>
<p>Hlavn&iacute;m specifikem indoor map je nutnost odd&#283;len&iacute;&nbsp;jednotliv&yacute;ch pater, tedy zobrazen&iacute; jedn&eacute; polohy v r&#367;zn&yacute;ch v&yacute;&scaron;k&aacute;ch.&nbsp;T&iacute;m se v&yacute;razn&#283; odli&scaron;uj&iacute; od venkovn&iacute;ch map i orienta&#269;n&iacute;ch pl&aacute;nk&#367;, kter&eacute; zobrazuj&iacute; v&#382;dy jen jeden pohled shora.</p>
<p>Term&iacute;n indoor mapy pou&#382;&iacute;v&aacute;me&nbsp;z toho d&#367;vodu, &#382;e&nbsp;se nejedn&aacute; pouze o pl&aacute;ny budov, ale v&scaron;ech vnit&#345;n&iacute;ch prostor. &nbsp;To zahrnuje i podzemn&iacute; prostory, zejm&eacute;na stanice metra, &#269;i vlakov&aacute; nadra&#382;&iacute; s podchody apod.</p>
<p>V kartografii se pl&aacute;n od mapy li&scaron;&iacute; t&iacute;m, &#382;e zanedb&aacute;v&aacute; zak&#345;iven&iacute; Zem&#283;. My ho ov&scaron;em pou&#382;&iacute;v&aacute;me v laick&eacute;m v&yacute;znamu, tedy pro v&scaron;echny detailn&iacute; mapy mal&eacute;ho &uacute;zem&iacute;. U webov&yacute;ch pl&aacute;n&#367; budov se ve v&#283;t&scaron;in&#283; p&#345;&iacute;pad&#367; bude technicky jednat o mapy, nebo&#357; vyu&#382;&iacute;vaj&iacute; zem&#283;pisn&yacute;ch sou&#345;adnic a stejn&eacute; mapov&eacute; projekce jako (okoln&iacute;) mapa venkovn&iacute;.</p>
<p>V t&eacute;to kapitole uvedeme sou&#269;asn&eacute; slu&#382;by a nast&iacute;n&iacute;me i teoretick&eacute; mo&#382;nosti souvisej&iacute;c&iacute; s indoor geolokac&iacute;.</p>

<p><img><img><img></p>
<p>Obr&aacute;zek1abc: Orienta&#269;n&iacute; pl&aacute;ny budov &#268;VUT &ndash; FSv<sup><a>[3]</a></sup>&nbsp;(a); FEL<sup><a>[4]</a></sup>&nbsp;(b); a FA<sup><a>[5]</a></sup>&nbsp;(c)</p>
<hr>
<h2>1.1. Sou&#269;asn&eacute; indoor slu&#382;by</h2>
<p>Sou&#269;asn&yacute;m indoor slu&#382;b&aacute;m p&#345;irozen&#283; dominuj&iacute; velc&iacute; hr&aacute;&#269;i na poli webov&yacute;ch map. V posledn&iacute;ch letech, t&eacute;&#382; d&iacute;ky n&aacute;stupu autonomn&iacute;ch vozidel, prob&#283;hlo n&#283;kolik zaj&iacute;mav&yacute;ch akvizic. Poj&#271;me si tedy shrnout &ldquo;kdo je kdo&rdquo;:</p>

<ul>
<li>TomTom &ndash; v roce 2008 akvizice firmy Teleatlas, nyn&iacute; poskytuje data pro Apple Maps a Uber. Od roku 2014 nav&aacute;zal ohledn&#283; indoor map partnerstv&iacute; s firmou Micello.<sup><a>[6]</a></sup></li>
<li>Micello &ndash; vznikla v roce 2007 v Sillicon Valley a nyn&iacute; m&aacute; zmapov&aacute;no nejv&#283;t&scaron;&iacute; mno&#382;stv&iacute; indoor prostor. Data nab&iacute;z&iacute; zejm&eacute;na do aplikac&iacute; t&#345;et&iacute;ch stran.<sup><a>[7]</a></sup></li>
<li>Google &ndash; do roku 2008 pou&#382;&iacute;val data TeleAtlasu, pozd&#283;ji vyu&#382;&iacute;v&aacute; vlastn&iacute; koupen&eacute; &#269;i p&#367;j&#269;en&eacute; datasety<sup><a>[8]</a></sup>. Indoor mapy nyn&iacute; implementuje do sv&yacute;ch Google Maps na v&scaron;ech platform&aacute;ch.</li>
<li>Here &ndash; v roce 2011 vzniklo jako Nokia Ovi Maps akvizic&iacute; firmy NAVTEQ. V prosinci 2015 koupeno n&#283;meck&yacute;mi automobilkami od firmy Nokia u&#382; pod n&aacute;zvem Nokia Here Maps<sup><a>[9]</a></sup>. Firma NAVTEQ uve&#345;ejnila sv&eacute; indoor &#345;e&scaron;en&iacute; na konferenci Nokia World 2010<sup><a>[10]</a></sup>, ov&scaron;em Here Maps ji&#382; tato data na webu nezobrazuj&iacute;. </li>
<li>Microsoft &ndash; slu&#382;ba Bing Maps ozn&aacute;mila indoor mapy v roce 2011 pod n&aacute;zvem Venue Maps<sup><a>[11]</a></sup>. Mapov&aacute; data nad&aacute;le vlastn&iacute;, ale divize tvorby byla odprod&aacute;na firm&#283; Uber (pot&eacute;,&nbsp;co tato prohr&aacute;la boj o Here Maps).<sup><a>[12]</a></sup></li>

</ul>
<p>Zcela vy&#269;erp&aacute;vaj&iacute;c&iacute; p&#345;ehled lze naj&iacute;t v tabulce &ldquo;The Indoor Navigation Market&rdquo;<sup><a>[13]</a></sup>&nbsp;od spole&#269;nosti BuildingLayer.</p>
<h3>1.1.1. Google Maps Indoor</h3>
<p>Google se stal konkurenc&iacute; v oblasti webov&yacute;ch map&nbsp;akvizic&iacute; n&#283;kolika startup&#367; v roce 2004&nbsp;&ndash;&nbsp;zejm&eacute;na firmy Keyhole, kter&aacute; dala za vznik legend&aacute;rn&iacute; aplikaci Google Earth. D&iacute;ky uvoln&#283;n&iacute; API, mobiln&iacute;m aplikac&iacute;m (v&#269;etn&#283; spolupr&aacute;ce s prvn&iacute;mi telefony iPhone v letech 2007-2012) a Street View se za&#269;al Google st&aacute;vat jedn&iacute;m z hlavn&iacute;ch hr&aacute;&#269;&#367; na trhu. Cel&yacute; poutav&yacute; p&#345;&iacute;b&#283;h m&#367;&#382;ete naj&iacute;t ve zdroji.<sup><a>[14]</a></sup></p>
<p>Indoor map&aacute;m se za&#269;al v&#283;novat v roce 2011, kdy spustil prohl&iacute;&#382;e&#269; v r&aacute;mci sv&eacute; aplikace pro Android.<sup><a>[15]</a></sup>&nbsp;Na sv&eacute; projektov&eacute; str&aacute;nce\footnote{<a>https://www.google.com/maps/about/partners/indoormaps/</a>} Google vyb&iacute;z&iacute; instituce, aby samy nahr&aacute;ly obr&aacute;zky podla&#382;n&iacute;ch pl&aacute;n&#367; a zarovnaly je v&#367;&#269;i satelitn&iacute; map&#283;. Samotnou vektorizaci pak d&#283;l&aacute; Google s&aacute;m.<sup><a>[16]</a></sup>&nbsp;V &#268;R tato slu&#382;ba zat&iacute;m nen&iacute; v provozu, ale jednotliv&eacute; instituce i tak mohou sv&eacute; pl&aacute;ny poslat.<sup><a>[17]</a></sup></p>

<p><img><img></p>
<p>Obr&aacute;zek2abc: Zobrazen&iacute; klasick&eacute; mapy&nbsp;v Google Maps (a); p&#345;epnut&iacute; do indoor zobrazen&iacute; (b); p&#345;ibl&iacute;&#382;en&iacute; (c)</p>
<p>Indoor zobrazen&iacute; se aktivuje jednak p&#345;i dostate&#269;n&eacute;m p&#345;ibl&iacute;&#382;en&iacute; mapy, jednak&nbsp;p&#345;i kliku na business listing, kter&yacute; je um&iacute;st&#283;n ve&nbsp;zmapovan&eacute; budov&#283;. V indoor zobrazen&iacute; se t&eacute;&#382; uk&aacute;&#382;e p&#345;ep&iacute;na&#269; pater budovy. </p>
<h3>1.1.2. Apple Maps Indoor</h3>

<p><img><img></p>
<p>Obr&aacute;zek3ab: 3D obrys budovy&nbsp;v Apple Maps&nbsp;bez indoor pl&aacute;nu (a); pouze zarovnan&eacute; ikony (b)</p>
<p>Spole&#269;nost Apple v sou&#269;asn&eacute; dob&#283; indoor mapy neposkytuje. Ov&scaron;em dle n&aacute;znak&#367; firma slu&#382;bu p&#345;ipravuje. V listopadu 2015 Apple zve&#345;ejnil aplikaci &ldquo;Indoor Survey&rdquo;<sup><a>[18]</a></sup>, kter&aacute; umo&#382;&#328;uje spr&aacute;vc&#367;m velk&yacute;ch n&aacute;kupn&iacute;ch center prov&eacute;st zam&#283;&#345;en&iacute; pro vnit&#345;n&iacute; geolokaci. Pomoc&iacute; aplikace se v budov&#283; zam&#283;&#345;&iacute; referen&#269;n&iacute; body a k nim ulo&#382;&iacute; otisk WiFi i Bluetooth vys&iacute;la&#269;&#367; a dat ze senzor&#367; iPhonu. Vice o speci&aacute;ln&iacute;ch geoloka&#269;n&iacute;ch Bluetooth vys&iacute;la&#269;&iacute;ch Apple iBeacon najdete v kapitole 1.2.</p>
<p>V pr&#367;b&#283;hu roku 2015 t&eacute;&#382; zarovnala um&iacute;st&#283;n&iacute; business listing&#367; na jejich spr&aacute;vn&eacute; sou&#345;adnice v r&aacute;mci budov n&aacute;kupn&iacute;ch center<sup><a>[19]</a></sup>.&nbsp;</p>
<p>Nen&iacute; jist&eacute;, zda Apple bude tvo&#345;it vlastn&iacute; indoor mapy, nebo jen vyu&#382;&iacute;vat p&#345;esnou indoor geolokaci pro aplikace t&#345;et&iacute;ch stran<sup><a>[20]</a></sup>.</p>
<h3>1.1.3. Microsoft Bing Maps</h3>
<p><img><img><img></p>
<p>Obr&aacute;zek4abc: Zobrazen&iacute; klasick&eacute; mapy&nbsp;v Bing Maps (a); p&#345;epnut&iacute; do indoor zobrazen&iacute; (b); p&#345;ibl&iacute;&#382;en&iacute; (c)</p>
<p>Spole&#269;nost Microsoft spustila sv&eacute; webov&eacute; mapy p&#367;vodn&#283; pod n&aacute;zvem Microsoft Virtual Earth na konci roku 2005. P&#345;esto&#382;e v mno&#382;stv&iacute; vlastnost&iacute; dostihuje Google Maps (leteck&eacute; pohledy, street view, 3D mapy, dopravn&iacute; informace), st&aacute;le z&#367;st&aacute;v&aacute; n&#283;kolik krok&#367; za n&iacute;m. Chyb&iacute; nap&#345;&iacute;klad podpora pro jin&eacute; mobiln&iacute; platformy ne&#382; Windows Phone. Pokryt&iacute; leteck&yacute;ch map &#269;i street view je subjektivn&#283; hor&scaron;&iacute;. </p>
<p>Sv&eacute; indoor &#345;e&scaron;en&iacute; pod n&aacute;zvem Bing Venue Maps spustila v roce 2011. Zobrazen&iacute; je podobn&eacute; slu&#382;b&#283; Micello, a tedy subjektivn&#283; p&#345;ehledn&#283;j&scaron;&iacute; ne&#382; Google. Obsahuje 5&nbsp;400&nbsp;m&iacute;st. Indoor re&#382;im se aktivuje kliknut&iacute;m na zv&yacute;razn&#283;nou budovu, p&#345;ep&iacute;na&#269; pater je um&iacute;st&#283;n do drobe&#269;kov&eacute; navigace v r&aacute;mci mapy (dle m&eacute;ho m&iacute;rn&#283; schovan&yacute;). Slu&#382;ba nav&iacute;c nab&iacute;z&iacute; adres&aacute;&#345;&nbsp;business listing&#367;&nbsp;v budov&#283; a t&eacute;&#382; mo&#382;nost proch&aacute;zet Venue Maps podle zem&#283; a kategorie. Pro &#268;R eviduje 2 leti&scaron;t&#283;, 45 n&aacute;kupn&iacute;ch center a pra&#382;skou zoologickou zahradu.</p>
<p>Slu&#382;ba vypad&aacute; z dne&scaron;n&iacute;ho pohledu m&iacute;rn&#283; zastarale, Microsoft toti&#382; posledn&iacute;ch n&#283;kolik let vyv&iacute;j&iacute; tzv. Bing Maps Preview, kter&eacute; ov&scaron;em lze nainstalovat pouze jako&nbsp;aplikaci pro Windows 10.</p>
<h3>1.1.4. Micello</h3>
<p>Spole&#269;nost Micello se ozna&#269;uje za vedouc&iacute;ho poskytovatele indoor map. Nab&iacute;z&iacute; p&#345;es 25 000 zmapovan&yacute;ch m&iacute;st,<sup><a>[21]</a></sup>&nbsp;v &#268;R je to asi des&iacute;tka m&iacute;st se subjektivn&#283; men&scaron;&iacute; &uacute;rovn&iacute; detail&#367; ne&#382; Bing. Spole&#269;nost se specializuje zejm&eacute;na na prodej dat, vlastn&iacute; aplikace nevyv&iacute;j&iacute;. Na jej&iacute;m webu lze naj&iacute;t jen omezen&yacute; prohl&iacute;&#382;e&#269;.</p>
<p>Aktivace indoor se prov&aacute;d&iacute; kliknut&iacute;m na ikonku budovy, chyb&iacute; p&#345;&iacute;m&aacute; integrace do okoln&iacute; mapy. Ikonky jsou v tomto p&#345;&iacute;pad&#283; zobrazeny na API Google Maps. Na za&#269;&aacute;tku roku 2016 ozn&aacute;mila spolupr&aacute;ci se startupem eeGeo, jeho&#382; c&iacute;lem je zmapovat celou Zemi ve 3D.<sup><a>[22]</a></sup></p>
<p>Jako jedin&yacute; z komer&#269;n&iacute;ch projekt&#367; umo&#382;&#328;uje omezenou editaci ve&#345;ejnost&iacute;.&nbsp;U&#382;ivatel m&#367;&#382;e zadat a&#382; 3 pozn&aacute;mky (n&aacute;vrhy na p&#345;ejmenov&aacute;n&iacute;, rozd&#283;len&iacute; prostor apod.), kter&eacute; pak Micello projde a p&#345;&iacute;padn&#283; schv&aacute;l&iacute;. D&aacute;le jako jedin&yacute; disponuje indoor routov&aacute;n&iacute;m.</p>
<p>Uk&aacute;zka dostupn&aacute; na: <a>www.micello.com/coverage</a>&nbsp;</p>
<p><img><img><img><img></p>
<p>Obr&aacute;zek5abc: Implementace indoor prohl&iacute;&#382;e&#269;e v aplikaci &ldquo;Mall of America&rdquo; (a); Uk&aacute;zka pokryt&iacute; (b) a prohl&iacute;&#382;e&#269;e (c) na webu Micello<sup><a>[23]</a></sup></p>
<h3>1.1.5. Open-source platforma Anyplace</h3>
<p>Otev&#345;en&aacute; platforma pod licenc&iacute; MIT nab&iacute;z&iacute; kompletn&iacute; &#345;e&scaron;en&iacute; pro indoor tvorbu, prohl&iacute;&#382;en&iacute; i geolokaci a klientsk&eacute; aplikace pro v&scaron;echny velk&eacute; mobiln&iacute; platformy.<sup><a>[24]</a></sup>&nbsp;Zdrojov&eacute; k&oacute;dy jsou dostupn&eacute; na GitHubu, v&#269;etn&#283; n&aacute;stroje pro zam&#283;&#345;en&iacute; zemsk&eacute;ho pole kompasem. V&yacute;voj prov&aacute;d&iacute; skupina na University of Cyprus. D&iacute;ky open-source povaze cel&eacute;ho projektu se na n&#283;j m&#367;&#382;eme pod&iacute;vat bl&iacute;&#382;e, zejm&eacute;na s ohledem na mo&#382;n&eacute; vyu&#382;it&iacute; n&#283;kter&yacute;ch komponent pro budouc&iacute; &#345;e&scaron;en&iacute; nad platformou OpenStreetMap.</p>
<p><img><img></p>
<p><img></p>






<p>Obr&aacute;zek6abc: Editace pl&aacute;nu FA &#268;VUT (a); zobrazen&iacute; pl&aacute;nu OC Sm&iacute;chov (b); logger pro Android (c)<sup><a>[25]</a></sup></p>
<p>Do Anyplace m&#367;&#382;e po p&#345;ihl&aacute;&scaron;en&iacute; kdokoliv nahr&aacute;t podla&#382;n&iacute; pl&aacute;n sv&eacute; budovy. Ten je t&#345;eba p&#345;esn&#283; zarovnat nad zobrazenou Google mapou a n&aacute;sledn&#283; je mo&#382;n&eacute; podla&#382;&iacute; pojmenovat, p&#345;idat body z&aacute;jmu a t&eacute;&#382; vytvo&#345;it routovac&iacute; graf (&ldquo;Add new edge&rdquo;). Zarovn&aacute;n&iacute; podla&#382;&iacute; je v&scaron;ak subjektivn&#283; velmi nep&#345;&iacute;jemn&eacute; a nen&iacute; ani dob&#345;e mo&#382;n&eacute; p&#345;idat vy&scaron;&scaron;&iacute; podla&#382;&iacute; na stejn&eacute; m&iacute;sto.</p>
<p>Zobrazovac&iacute; rozhran&iacute; Anyplace je implementov&aacute;no tak&eacute; nad API Google Maps. Podobn&#283; jako v Micello jsou v klasick&eacute; map&#283; ikonky zmapovan&yacute;ch budov, ov&scaron;em po rozkliku se budova v map&#283; jen elegantn&#283; p&#345;ekryje zvolen&yacute;m pl&aacute;nem podla&#382;&iacute;. Umo&#382;&#328;uje prohled&aacute;n&iacute; v&scaron;ech bod&#367; z&aacute;jmu, jednoduch&eacute; zobrazen&iacute; trasy mezi body a mo&#382;nost sd&iacute;let adresu &#269;i vlo&#382;it mapku do jin&eacute;ho webu.</p>
<p>Cel&aacute; aplikace v&#269;etn&#283; editace je postavena nad vlastn&iacute;m RESTful API, kter&eacute; je i dob&#345;e dokumentov&aacute;no.<sup><a>[26]</a></sup>&nbsp;Nab&iacute;z&iacute; se tak nap&#345;&iacute;klad i teoretick&aacute; mo&#382;nost importu-exportu dat mezi Anyplace a OpenStreetMap.</p>
<p>Mobiln&iacute; aplikace pro platformy Android a Windows Phone jsou sp&iacute;&scaron;e proof-of-concept, ale nab&iacute;zej&iacute; alespo&#328;&nbsp;z&aacute;kladn&iacute; funkcionalitu. Android aplikaci lze p&#345;epnout t&eacute;&#382; do re&#382;imu Logger, kdy zaznamen&aacute;v&aacute; data pro indoor geolokaci na z&aacute;klad&#283; Wi-Fi, kompasu a IMU&nbsp;(viz. kapitola 1.2).</p>
<p>Anyplace se tedy jev&iacute; jako velmi vhodn&yacute; zdroj pro dal&scaron;&iacute; vyu&#382;&iacute;t&iacute;, zejm&eacute;na v kombinaci s indoor daty OpenStreetMap.</p>
<p>V&iacute;ce informac&iacute; na <a>github.com/dmsl/anyplace</a>&nbsp;</p>
<h3>1.1.6. Codrops Interactive 3D Mall Map</h3>
<p>Tento koncept modern&iacute;ho prohl&iacute;&#382;e&#269;e indoor pl&aacute;nu n&aacute;kupn&iacute;ho centra je vytvo&#345;en pomoc&iacute; technologi&iacute; CSS a SVG. Projekt je k dispozici jako open-source na GitHubu, zve&#345;ejn&#283;n&yacute; pod licenc&iacute; podobnou CC-BY-SA.</p>
<p>Sice nejde o mapovou aplikaci, ale i tak nab&iacute;z&iacute; zaj&iacute;mavou inspiraci z hlediska interak&#269;n&iacute;ho designu (UX). Mo&#382;n&eacute; vyu&#382;&iacute;ti je diskutov&aacute;no v kapitole 4.</p>
<p>V&iacute;ce informac&iacute; na <a>github.com/codrops/Interactive3DMallMap</a></p>
<p><img><img></p>
<p>Obr&aacute;zek7ab: Vizualizace pater n&aacute;kupn&iacute;ho centra v Codrops</p>

<h3>1.1.7. &#268;VUT Navig&aacute;tor</h3>
<p>P&#345;ed n&#283;kolika lety vytvo&#345;ili kolegov&eacute; z &#268;VUT platformu pro spr&aacute;vu a zobrazen&iacute; indoor map, zejm&eacute;na pro navigaci.<sup><a>[27]</a></sup>&nbsp;V sou&#269;asn&eacute; dob&#283; nen&iacute; v provozu, ale jednu z v&yacute;sledn&yacute;ch&nbsp;mobiln&iacute;ch&nbsp;aplikac&iacute;&nbsp;p&#283;kn&#283; prezentuje video dostupn&eacute; na YouTube\footnote{ <a>https://www.youtube.com/watch?v=3xEbvc49mgQ</a>}&nbsp;&ndash; zahrnovala rozvrh studenta, klasickou m&#283;stskou mapu pro vyhled&aacute;n&iacute; budovy, naviga&#269;n&iacute; indoor mapy a geolokaci pomoc&iacute; QR k&oacute;d&#367;&nbsp;zpest&#345;enou tzv. roz&scaron;&iacute;&#345;enou realitou. </p>
<p>Pl&aacute;ny jednotliv&yacute;ch podla&#382;&iacute; byly rastrov&eacute; a nad nimi byl ru&#269;n&#283; vytvo&#345;en routovac&iacute; graf. Datov&yacute;m zdrojem byla serverov&aacute; aplikace nad speci&aacute;ln&#283; navr&#382;en&yacute;m API. Tvorba a &uacute;prava pl&aacute;n&#367;&nbsp;byla umo&#382;n&#283;na&nbsp;v&scaron;em &#269;len&#367;m akademick&eacute; obce. To byl i hlavn&iacute; d&#367;vod vzniku tohoto projektu, proto&#382;e p&#345;edchoz&iacute; podobn&eacute; pokusy selhaly na tom, &#382;e je nikdo neudr&#382;oval.</p>
<p>Tento rok&nbsp;(2016) bude t&eacute;&#382; obhajov&aacute;no n&#283;kolik z&aacute;v&#283;re&#269;n&yacute;ch prac&iacute; pod n&aacute;zvem &#268;VUT Navig&aacute;tor 3.0. Soust&#345;ed&iacute; se na r&#367;zn&eacute; klientsk&eacute; aplikace pro indoor navigaci. Vyu&#382;&iacute;vaj&iacute; nov&eacute; vektorov&eacute; API nad CMS ModX. \footnote{Na&scaron;e pr&aacute;ce &#345;e&scaron;&iacute; obecn&yacute; probl&eacute;m z&iacute;sk&aacute;v&aacute;n&iacute; a spr&aacute;vy indoor map v r&aacute;mci otev&#345;en&eacute;, zaveden&eacute; platformy OpenStreetMap, m&#367;&#382;e tedy b&yacute;t v budoucnu zdrojem i pro toto &nbsp;naviga&#269;n&iacute; &#345;e&scaron;en&iacute;. }</p>
<h3>1.1.8. i-locate consorcium a IndoorGML form&aacute;t</h3>
<p>V souvislosti s touto prac&iacute; je t&#345;eba zm&iacute;nit program podpo&#345;en&yacute; Evropskou uni&iacute;, kter&yacute; si klade za c&iacute;l&nbsp;vytvo&#345;it &ldquo;prot&#283;j&scaron;ek OpenStreetMap pro indoor pou&#382;it&iacute;&rdquo;.<sup><a>[28]</a></sup>&nbsp;Projekt b&#283;&#382;&iacute; od za&#269;&aacute;tku roku 2014 do konce 2016 a m&#283;l by vytvo&#345;it infrastrukturu, n&aacute;stroje a form&aacute;ty pro open-data i crowd-sourcing.</p>
<p>D&#367;le&#382;itou &#269;&aacute;st&iacute; projektu je IndoorGML form&aacute;t &ndash; standard p&#345;ijat&yacute; OpenGeo Consorciem.<sup><a>[29]</a></sup>&nbsp;M&#283;l by slou&#382;it jako otev&#345;en&yacute; XML&nbsp;form&aacute;t pro v&yacute;m&#283;nu a modelov&aacute;n&iacute; indoor dat, v&#269;etn&#283; mo&#382;nosti pro vyu&#382;it&iacute; routingu a napojen&iacute; na na struktury vn&#283;j&scaron;&iacute;ho sv&#283;ta, tedy nap&#345;&iacute;klad form&aacute;t CityGML. Editor IndoorGML je postaven jako plugin<sup><a>[30]</a></sup>&nbsp;editoru JOSM (v&iacute;ce v kapitole 2.2.).</p>
<h3>1.1.9. Google Project Tango</h3>
<p>Google se ji&#382; del&scaron;&iacute; dobu zab&yacute;v&aacute; p&#345;esn&yacute;m modelov&aacute;n&iacute;m prostoru, trasov&aacute;n&iacute; polohy a vn&iacute;m&aacute;n&iacute; hloubky.<sup><a>[31]</a></sup>&nbsp;P&#345;ipravuje tak p&#367;du pokro&#269;il&yacute;m aplikac&iacute;m roz&scaron;&iacute;&#345;en&eacute; reality\footnote{Obraz re&aacute;ln&eacute;ho sv&#283;ta je dopln&#283;n objekty generovan&yacute;mi po&#269;&iacute;ta&#269;em, anglicky Augmented Reality}, ale po&#269;&iacute;t&aacute; se i s crowd-sourcingem vnit&#345;n&iacute;ch prostor&#367; pro mapy. V &uacute;noru 2016 Google nab&iacute;dl&nbsp;p&#367;sobiv&eacute; demo<sup><a>[32]</a></sup>, ve kter&eacute;m tablet p&#345;i proch&aacute;zen&iacute; muzeem &#382;iv&#283; modeluje okoln&iacute; 3D prostor, zn&aacute; svou polohu s p&#345;esnost&iacute; na centimetry a d&iacute;ky tomu ukazuje v roz&scaron;&iacute;&#345;en&eacute; realit&#283; naviga&#269;n&iacute; prvky na podlaze. Tento syst&eacute;m sice vy&#382;aduje speci&aacute;ln&iacute; podporu hardwaru (p&#345;esn&#283;j&scaron;&iacute; senzory, kamery, v&yacute;kon atd.), ale velmi dob&#345;e ilustruje, kam by se mohla technologie indoor geolokace a navigace ub&iacute;rat.</p>
<p><img></p>
<p>Obr&aacute;zek8: Ilustra&#269;n&iacute; obr&aacute;zek rozpozn&aacute;n&eacute;ho 3D profilu a zaznamenan&eacute; stopy</p>
<h2>1.2. Geolokace</h2>
<p>Pro venkovn&iacute; pou&#382;it&iacute; se nej&#269;ast&#283;ji mluv&iacute; o satelitn&iacute; navigaci&nbsp;&ndash; tedy dopo&#269;&iacute;t&aacute;n&iacute; polohy triangulac&iacute; z obdr&#382;en&yacute;ch &#269;asov&yacute;ch raz&iacute;tek n&#283;kolika satelit&#367;. Pro ur&#269;en&iacute; polohy (tzv. fix) je pot&#345;eba p&#345;&iacute;m&aacute; viditelnost alespo&#328; t&#345;&iacute; satelit&#367; po dobu 12,5 minuty<sup><a>[33]</a></sup>&nbsp;(p&#345;i tzv. studen&eacute;m startu). Dne&scaron;n&iacute; za&#345;&iacute;zen&iacute; &#269;asto implementuj&iacute; n&#283;kolik paraleln&iacute;ch syst&eacute;m&#367;, zejm&eacute;na americk&yacute; Navstar GPS, rusk&yacute; Glonass nebo evropsk&yacute; Galileo. A d&aacute;le syst&eacute;m A-GPS, kter&yacute; urychluje prvn&iacute; fix z&iacute;sk&aacute;n&iacute;m n&#283;kter&yacute;ch dat pomoc&iacute; mobiln&iacute;ho internetu. T&iacute;m je dosa&#382;eno vy&scaron;&scaron;&iacute; p&#345;esnosti a t&eacute;&#382; mo&#382;nost ur&#269;en&iacute; polohy i v zaru&scaron;en&eacute;m prost&#345;ed&iacute;. Uvnit&#345; budovy je tento syst&eacute;m t&eacute;m&#283;&#345; nepou&#382;iteln&yacute;, nebo&#357; chyb&iacute; p&#345;&iacute;m&aacute; viditelnost na oblohu. Lze proto dos&aacute;hnout pouze n&aacute;hodn&eacute;ho fixu, &#269;asto s velkou nep&#345;esnost&iacute;.</p>
<p>Dal&scaron;&iacute; venkovn&iacute; syst&eacute;m vyu&#382;&iacute;v&aacute; zam&#283;&#345;en&iacute; GSM vys&iacute;la&#269;&#367;&nbsp;(tj. BTS), ten s jistou &uacute;sp&#283;&scaron;nost&iacute; funguje i v budov&aacute;ch. Krom&#283; bezpe&#269;nostn&iacute;ch slo&#382;ek jej v praxi nikdo nepou&#382;&iacute;v&aacute;, nebo&#357; oper&aacute;to&#345;i dovoluj&iacute; p&#345;ipojen&iacute; pouze k jedn&eacute; BTS.&nbsp;Poloha je pak p&#345;ibli&#382;n&aacute;, vymezen&aacute; kru&#382;nic&iacute; kolem p&#345;ipojen&eacute; BTS s polom&#283;rem stovky metr&#367; a&#382; des&iacute;tek kilometr&#367;. </p>
<p>Posledn&iacute;m venkovn&iacute;m syst&eacute;mem je triangulace Wi-Fi vys&iacute;la&#269;&#367;<sup><a>[34]</a></sup>, kter&aacute; vyu&#382;&iacute;v&aacute; hust&eacute;ho pokryt&iacute; t&iacute;mto sign&aacute;lem v zastav&#283;n&yacute;ch m&#283;stsk&yacute;ch oblastech. Data v&scaron;ak mus&iacute; b&yacute;t p&#345;edem prom&#283;&#345;ena a shrom&aacute;&#382;d&#283;na. Kv&#367;li aktualizaci i p&#345;&iacute;padn&eacute; telemetrii (m&#283;&#345;en&iacute; pomoc&iacute; p&#345;ipojen&yacute;ch klientsk&yacute;ch za&#345;&iacute;zen&iacute;) jsou tato data typicky ulo&#382;ena v on-line centralizovan&eacute;m &uacute;lo&#382;i&scaron;ti. Tento syst&eacute;m zaznamenal velk&yacute; rozmach s n&aacute;stupem smartphon&#367;, zejm&eacute;na d&iacute;ky implementaci v syst&eacute;mech Android v podob&#283; &ldquo;Google Location Services&rdquo;. Tam mus&iacute; u&#382;ivatel souhlasit, &#382;e jeho data budou pou&#382;ita ke zp&#345;es&#328;ov&aacute;n&iacute; slu&#382;eb, tedy telemetrii. Tento syst&eacute;m se velmi v&yacute;hodn&#283; vyu&#382;&iacute;v&aacute; i uvnit&#345; budov.</p>
<p>Pro indoor geolokaci (t&eacute;&#382; Indoor Position System &ndash; IPS) nav&iacute;c v posledn&iacute; dob&#283; vzniklo n&#283;kolik dal&scaron;&iacute;ch syst&eacute;m&#367; a roz&scaron;&iacute;&#345;en&iacute;:</p>

<ol>
<li>Triangulace Wi-Fi dopln&#283;n&aacute; o frekvence Bluetooth&nbsp;&ndash; typicky se jedn&aacute; o standard BT&nbsp;LE 4.0, kter&yacute; umo&#382;&#328;uje vytvo&#345;it mal&eacute; vys&iacute;la&#269;e s provozem na baterii n&#283;kolik let. Krom&#283; existuj&iacute;c&iacute; infrastruktury Wi-Fi je ov&scaron;em nutn&eacute; po&#345;&iacute;dit tyto mal&eacute; vys&iacute;la&#269;e a rozm&iacute;stit je po budov&#283;, co&#382; pro ve&#345;ejn&eacute; instituce a rozlehl&eacute; v&iacute;cepatrov&eacute; budovy m&#367;&#382;e b&yacute;t finan&#269;n&#283; n&aacute;ro&#269;n&eacute;. <br><br>Krom&#283; &#269;ist&#283; identifika&#269;n&iacute;ch beacon&#367; se &#269;asto p&#345;ipojuj&iacute; i dal&scaron;&iacute; m&iacute;stn&#283; relevantn&iacute; informace, nap&#345;. URL&nbsp;vystaven&eacute;ho expon&aacute;tu. Pod &bdquo;buzzwordem&ldquo;&nbsp;Physical Web tyto funkce nab&iacute;z&iacute; Google Eddystone (jako open-source), Apple iBeacon (pouze pro za&#345;&iacute;zen&iacute; t&eacute;to zna&#269;ky) &#269;i dal&scaron;&iacute; produkty kombinuj&iacute;c&iacute; i v&iacute;ce protokol&#367;. </li>
<li>M&#283;&#345;en&iacute; anom&aacute;li&iacute; magnetick&eacute; charakteristiky zemsk&eacute;ho pole&nbsp;&ndash; to je snadno dostupn&eacute; pomoc&iacute;&nbsp;b&#283;&#382;n&eacute;ho&nbsp;digit&aacute;ln&iacute;ho&nbsp;kompasu. Tato technologie nevy&#382;aduje finan&#269;n&iacute; investici, ov&scaron;em je t&#345;eba proj&iacute;t v&scaron;echna m&iacute;sta v budov&#283; a p&#345;itom na map&#283; volit referen&#269;n&iacute; body. Op&#283;t vy&#382;aduje ulo&#382;en&iacute; dat typicky v online &uacute;lo&#382;i&scaron;ti a t&eacute;&#382; obnovovac&iacute; m&#283;&#345;en&iacute; p&#345;i zm&#283;n&#283; kovov&yacute;ch struktur budovy.<sup><a>[35]</a></sup><br><br> Opensource &#345;e&scaron;en&iacute; nab&iacute;z&iacute; Anyplace, komer&#269;n&iacute; nap&#345;&iacute;klad <a>indooratlas.com</a>.</li>
<li>&ldquo;Dead reckoning&rdquo;<sup><a>[36]</a></sup>&nbsp;&ndash; jedn&aacute; se o odhad geolokace na z&aacute;klad&#283; posledn&iacute; ur&#269;en&eacute; polohy a sm&#283;ru pohybu. Ve smartphonech lze vyu&#382;&iacute;t akcelerometru (IMU), ov&scaron;em nep&#345;esnost vinou s&#269;&iacute;t&aacute;n&iacute; chyby neust&aacute;le nar&#367;st&aacute;.</li>
<li>Dal&scaron;&iacute; m&eacute;n&#283; pou&#382;&iacute;van&eacute; metody<sup><a>[37]</a></sup>&nbsp;zahrnuj&iacute;: akustick&yacute; otisk m&iacute;stnosti<sup><a>[38]</a></sup>, &#269;te&#269;ku QR&nbsp;k&oacute;d&#367;, krokom&#283;r &#269;i dvoukolov&yacute; odometr pro vozidla &#269;i voz&iacute;ky.</li>

</ol>
<p>Sou&#269;asn&eacute; toolkity Google Location Services&nbsp;a Apple Core Location&nbsp;kombinuj&iacute; v&iacute;ce uveden&yacute;ch technik jak pro venkovn&iacute;,&nbsp;tak i pro vnit&#345;n&iacute; pou&#382;it&iacute;.</p>

<hr>
<h1>2. &#344;e&scaron;en&iacute; nad platformou OpenStreetMap</h1>
<p>Otev&#345;en&aacute; mapa sv&#283;ta &ndash; OpenStreetMap &ndash; je projekt, kter&yacute; si klade za c&iacute;l vytvo&#345;it crowd-sourcovanou mapu sv&#283;ta pod svobodnou licenc&iacute;. V mnoh&eacute;m je tedy podobn&yacute; dob&#345;e zn&aacute;m&eacute; encyklopedii Wikipedia. Zalo&#382;il ho v roce 2004 Steve Coast v Anglii, zejm&eacute;na z d&#367;vodu nedostupnosti vhodn&yacute;ch dat pro satelitn&iacute; navigace. O &#269;ty&#345;i roky pozd&#283;ji byl projekt zast&#345;e&scaron;en neziskovou organizac&iacute; OpenStreetMap Foundation a data do projektu postupn&#283; d&aacute;l p&#345;ib&yacute;vala. Velk&yacute; &uacute;sp&#283;ch zaznamenal v roce 2012, kdy ho za&#269;alo pou&#382;&iacute;vat n&#283;kolik velik&yacute;ch spole&#269;nost&iacute; z d&#367;vodu zpoplatn&#283;n&iacute; Google Maps API. Od t&eacute; doby &uacute;sp&#283;&scaron;n&#283; roste d&aacute;l. </p>
<p><img><img></p>
<p>Obr&aacute;zek21ab: Po&#269;et registrovan&yacute;ch u&#382;ivatel&#367; v OSM (log. m&#283;&#345;&iacute;tko) (a); aktivn&iacute;&nbsp;u&#382;ivatel&eacute; za m&#283;s&iacute;c v modr&eacute; barv&#283; (b)<sup><a>[39]</a></sup></p>
<p>Technicky se jedn&aacute; o vektorovou mapovou datab&aacute;zi, kterou m&#367;&#382;e upravovat ka&#382;d&yacute; zaregistrovan&yacute; u&#382;ivatel. Pokud se tedy n&#283;kdo rozhodne zmapovat t&#345;eba v&scaron;echna pi&aacute;na na ulic&iacute;ch, m&#367;&#382;e si na to vytvo&#345;it vlastn&iacute; zna&#269;ku a do datab&aacute;ze je p&#345;idat. Omezen&iacute; je jedin&eacute;, aby byl objekt fyzicky p&#345;&iacute;tomn&yacute;&nbsp;v re&aacute;ln&eacute;m sv&#283;t&#283;. To se samoz&#345;ejm&#283; t&yacute;k&aacute; i vnit&#345;k&#367; budov.</p>
<p>Aby to v&scaron;e dob&#345;e fungovalo, udr&#382;uje sv&#283;tov&aacute; komunita OpenStreetMap spole&#269;n&yacute; zna&#269;kovac&iacute; kl&iacute;&#269;&nbsp;(tzv. Map Features), kter&yacute; glob&aacute;ln&#283; ur&#269;uje, jak se budou ur&#269;it&eacute; objekty zna&#269;it. D&iacute;ky tomu je mo&#382;n&eacute; vykreslit silni&#269;n&iacute; s&iacute;&#357; cel&eacute;ho sv&#283;ta, &#269;i naj&iacute;t cyklistickou trasu z Madridu na Sibi&#345;. Ke spole&#269;n&eacute; shod&#283; doch&aacute;z&iacute; pomoc&iacute; procesu tzv. proposals (n&aacute;vrh&#367;).</p>
<p>Zna&#269;kovac&iacute; kl&iacute;&#269; &ndash; t&eacute;&#382; tagov&aacute;n&iacute; &ndash; je k dispozici i v &#269;esk&eacute;m p&#345;ekladu\footnote{<a>wiki.osm.org/Cs:Map_Features</a>}. Obsahuje hlavn&iacute; kategorie v&scaron;ech objekt&#367;, dal&scaron;&iacute; up&#345;esn&#283;n&iacute; jsou pak k dispozici na str&aacute;nk&aacute;ch jednotliv&yacute;ch zna&#269;ek. Ov&scaron;em to, &#382;e je nap&#345;&iacute;klad lavi&#269;ka ve zna&#269;kov&eacute;m kl&iacute;&#269;i&nbsp;neznamen&aacute;, &#382;e by v OpenStreetMap byly zaneseny v&scaron;echny lavi&#269;ky na sv&#283;t&#283;. To v&#382;dy z&aacute;le&#382;&iacute; na m&iacute;stn&iacute; komunit&#283; a zejm&eacute;na konkr&eacute;tn&iacute;ch p&#345;isp&#283;vatel&iacute;ch, co se kdo rozhodne mapovat. &#268;esk&aacute; komunita je jedna z t&#283;ch aktivn&#283;j&scaron;&iacute;ch, a tak jsou v &#268;R zmapov&aacute;ny v&scaron;echny hlavn&iacute; silnice, &#269;&iacute;sla popisn&aacute; &#269;i t&#345;eba velk&eacute; mno&#382;stv&iacute; turistick&yacute;ch zna&#269;ek a cyklotras.<sup><a>[40]</a></sup></p>
<p>Indoor mapov&aacute;n&iacute; je pro OpenStreetMap p&#345;irozenou v&yacute;zvou, a proto nep&#345;ekvap&iacute;, &#382;e p&#345;isp&#283;vatel&eacute; ji&#382; t&iacute;mto sm&#283;rem vyvinuli nemal&eacute; &uacute;sil&iacute;. Do nyn&#283;j&scaron;ka ov&scaron;em &#382;&aacute;dn&yacute; n&aacute;vrh p&#345;ijat&yacute; nebyl, proto se v t&eacute;to pr&aacute;ci pokus&iacute;me vyu&#382;&iacute;t z&iacute;skan&yacute;ch poznatk&#367;, pou&#269;it se z chyb a navrhnout &#345;e&scaron;en&iacute;, kter&eacute; bude m&iacute;t &scaron;anci na &uacute;sp&#283;ch. V&iacute;ce v kapitole 2.4.</p>
<p>Tak jako Steve Coast&nbsp;m&#283;l v roce 2004 vizi o celosv&#283;tov&eacute; map&#283; ulic, tak my nyn&iacute; m&#367;&#382;eme p&#345;edest&#345;&iacute;t vizi celosv&#283;tov&eacute; indoor mapy tvo&#345;en&eacute; u&#382;ivateli. V&yacute;hody jsou nasnad&#283;, z voln&yacute;ch geodat a jednotn&eacute;ho form&aacute;tu pro cel&yacute; sv&#283;t m&#367;&#382;e vzniknout mno&#382;stv&iacute; velmi zaj&iacute;mav&yacute;ch aplikac&iacute;. P&#345;&iacute;klady jsou k vid&#283;n&iacute; u&#382; dnes. Za v&scaron;echny uve&#271;me aplikaci Maps.me &ndash; pro v&scaron;echny mobiln&iacute; platformy umo&#382;&#328;uje offline zobrazen&iacute; mapy v&#269;etn&#283; 3D budov, navigaci &#269;i editaci bod&#367; z&aacute;jmu samotn&yacute;mi u&#382;ivateli. </p>
<p>Otev&#345;en&aacute; data v&#382;dy p&#345;il&aacute;kaj&iacute; mnoho firem a tv&#367;rc&#367; aplikac&iacute;, a d&iacute;ky tomu vzniknou i nov&aacute; a ne&#269;ekan&aacute; vyu&#382;it&iacute;. M&#367;&#382;e se jednat o r&#367;zn&eacute; prohl&iacute;&#382;e&#269;e, aplikace ve&#345;ejn&yacute;ch instituc&iacute; pro n&aacute;v&scaron;t&#283;vn&iacute;ky s integrac&iacute; mapy, prodejce nemovitost&iacute;, navigaci osob se sn&iacute;&#382;enou schopnost&iacute; orientace, &#269;i zcela glob&aacute;ln&iacute; prohl&iacute;&#382;e&#269; map v&#269;etn&#283; indoor re&#382;imu.</p>
<h2>2.1. Core architektura</h2>
<p>Poj&#271;me si nyn&iacute; uk&aacute;zat, na &#269;em je OpenStreetMap postaveno &ndash; vnit&#345;n&iacute; zp&#367;sob ukl&aacute;d&aacute;n&iacute; dat, API a z&aacute;kladn&iacute; n&aacute;stroje pro pokro&#269;ilou pr&aacute;ci.</p>
<p>Mapov&aacute; data nejsou jako v klasick&eacute;m GISu objekty s geometri&iacute;. M&iacute;sto toho se vyu&#382;&iacute;v&aacute; specifick&eacute; sch&eacute;ma, kter&eacute; m&aacute; tu v&yacute;hodu, &#382;e zachov&aacute;v&aacute; topologii a je tak p&#345;&iacute;mo vhodn&eacute; jako routovac&iacute; graf. Z&aacute;kladn&iacute; prvky jsou tyto:</p>

<ul>
<li>uzel&nbsp;(node) &ndash; bod, kter&yacute; jako jedin&yacute; nese sou&#345;adnice,</li>
<li>cesta&nbsp;(way) &ndash; posloupnost referenc&iacute; na uzly; nejde o cestu v b&#283;&#382;n&eacute; &#345;e&#269;i, ale v terminologii OSM, v&yacute;znam j&iacute; dod&aacute;vaj&iacute; a&#382; aplikovan&eacute; tagy, &nbsp;</li>
<li>relace (relation) &ndash; reference v&iacute;ce uzl&#367;, cest a relac&iacute;.</li>

</ul>
<p>Samotn&yacute; v&yacute;znam je pak mo&#382;n&eacute; ke ka&#382;d&eacute;mu primitivn&iacute;mu prvku p&#345;id&aacute;vat v podob&#283; libovoln&yacute;ch zna&#269;ek &ndash; tag&#367;. Krom toho je&scaron;t&#283; cesta m&#367;&#382;e znamenat i plochu &ndash; to v p&#345;&iacute;pad&#283;, kdy je uzav&#345;en&aacute; a nese ur&#269;it&eacute; tagy (t&#345;eba area=yes). T&iacute;mto je tedy v&yacute;&#269;et &uacute;pln&yacute;:</p>

<ul>
<li>zna&#269;ka (tag) &ndash; kl&iacute;&#269; a hodnota (nap&#345;. highway=residential),</li>
<li>plocha&nbsp;(area) &ndash; uzav&#345;en&aacute; cesta, kter&aacute; nese ur&#269;it&eacute; tagy,</li>
<li>metadata&nbsp;&ndash; dopl&#328;kov&eacute; informace pro spr&aacute;vu dat (autor, id, verze, changeset).</li>

</ul>
<p>Editace se prov&aacute;d&iacute; pomoc&iacute; API tak, &#382;e u&#382;ivatel po&scaron;le upraven&eacute; prvky v r&aacute;mci jednoho zm&#283;nov&eacute;ho po&#382;adavku, tzv. changesetu. V datab&aacute;zi se pak vytvo&#345;&iacute; nov&eacute; prvky a uprav&iacute; ty st&aacute;vaj&iacute;c&iacute; zv&yacute;&scaron;en&iacute;m verze. Smaz&aacute;n&iacute; se provede nastaven&iacute;m p&#345;&iacute;znaku visible, technicky tedy jde pouze o &uacute;pravu. V p&#345;&iacute;pad&#283; vandalsk&eacute; editace je tak mo&#382;n&eacute; cel&yacute; changeset odvolat (revert) a vr&aacute;tit data do p&#367;vodn&iacute; podoby.</p>
<h3>2.1.1. Data a OSM XML</h3>
<p>Data se ve v&#283;t&scaron;in&#283; p&#345;&iacute;pad&#367; reprezentuj&iacute; ve form&aacute;tu OSM XML. Uve&#271;me si jednoduch&yacute; p&#345;&iacute;klad TODOobr22.&nbsp;Obsahuje t&#345;i uzly, z nich&#382; rozcestn&iacute;k stoj&iacute; zcela samostatn&#283; a dva uzly jsou referencov&aacute;ny v r&aacute;mci cesty. Jeden z t&#283;chto uzl&#367; v cest&#283; nese z&aacute;rove&#328; dal&scaron;&iacute; vlastnost &ndash; pomn&iacute;&#269;ek. </p>
<p>Relace sdru&#382;uje v&scaron;echny zm&iacute;n&#283;n&eacute; prvky a vytv&aacute;&#345;&iacute; turistickou trasu &ldquo;Odbo&#269;ka k pomn&iacute;&#269;ku&rdquo;, kde definuje jej&iacute; barvu, referen&#269;n&iacute; &#269;&iacute;slo i symbol, kter&yacute; m&aacute; b&yacute;t vykreslen.</p>
<p>Informace o topologii &ndash; napojen&iacute; cest &ndash; je tak d&aacute;na referencov&aacute;n&iacute;m ID stejn&eacute;ho uzlu. Ji&#382; je ponech&aacute;no na konzumentovi dat, aby z&iacute;skal pouze relevantn&iacute; prvky (typicky cesty s tagem highway=*) a n&aacute;sledn&#283; si z dota&#382;en&yacute;ch uzl&#367; vynesl geometrii cest a spo&#269;&iacute;tal ohodnocen&iacute; hran. </p>
<p>Relace v principu p&#345;en&aacute;&scaron;&iacute; sv&eacute; tagy na jednotliv&eacute; &#269;leny. Doporu&#269;uje se tedy pou&#382;&iacute;vat pouze tam, kde je skute&#269;n&#283; pot&#345;eba. Kv&#367;li hor&scaron;&iacute; mo&#382;nosti editace je nap&#345;&iacute;klad nevhodn&aacute; pro sdru&#382;ov&aacute;n&iacute; v&iacute;ce cest tvo&#345;&iacute;c&iacute; jednu ulici. Naopak rozs&aacute;hlej&scaron;&iacute; sdru&#382;en&iacute; objekt&#367;, typicky turistick&eacute; trasy, jsou v relac&iacute;ch v&iacute;tan&eacute;, nebo&#357; se l&eacute;pe udr&#382;uj&iacute; a t&eacute;&#382; je umo&#382;n&#283;no vyu&#382;&iacute;t jedn&eacute; fyzick&eacute; cesty pro veden&iacute; v&iacute;ce tras. &#268;leny nav&iacute;c mohou m&iacute;t v dan&eacute; relaci uvedenou roli.</p>
<p><img></p>
<p>Obr&aacute;zek22: Uk&aacute;zka form&aacute;tu OSM XML a reprezentace v editoru JOSM<sup><a>[41]</a></sup></p>
<p>Nej&#269;ast&#283;ji pou&#382;&iacute;van&eacute; typy jsou tyto, ur&#269;uj&iacute; se tagem type=*:</p>

<ul>
<li>Route&nbsp;&ndash; veden&iacute; turistick&yacute;ch, cyklistick&yacute;ch tras, &#269;i trasy MHD, trajekt&#367; apod. (viz p&#345;&iacute;klad).</li>
<li>Multipolygon&nbsp;&ndash; jednak umo&#382;&#328;uje plo&scaron;e vymezit, kde se nenach&aacute;z&iacute; (tj. ohrani&#269;it d&iacute;ru), jednak pro rozs&aacute;hl&eacute; plochy (lesn&iacute; porost) umo&#382;&#328;uje sdru&#382;it v&iacute;ce okrajov&yacute;ch cest. Ty jsou d&#283;leny z d&#367;vodu snaz&scaron;&iacute; pr&aacute;ce v editorech.</li>
<li>Boundary&nbsp;&ndash; sdru&#382;uje okrajov&eacute; cesty &uacute;zemn&iacute;ch hranic a t&eacute;&#382; relace pod&#345;&iacute;zen&yacute;ch oblast&iacute;. Nap&#345;&iacute;klad relace &#268;esk&eacute; republiky bude obsahovat v&scaron;echny hrani&#269;n&iacute; cesty&nbsp;(ve smyslu cesty v OSM) a relace v&scaron;ech kraj&#367;.</li>
<li>Restriction&nbsp;&ndash; zaznamen&aacute;v&aacute; z&aacute;kazy odbo&#269;en&iacute;, kter&eacute; implicitn&#283; neplynou z jednosm&#283;rek.</li>

</ul>
<p>D&iacute;ky velk&eacute; rozmanitosti z&iacute;sk&aacute;v&aacute;n&iacute; dat je mo&#382;n&eacute; narazit na r&#367;zn&eacute; z&aacute;pisy t&eacute;ho&#382;. Zejm&eacute;na bod z&aacute;jmu (nap&#345;. pomn&iacute;&#269;ek) m&#367;&#382;e b&yacute;t ve vztahu k p&#345;&iacute;stupov&eacute; cest&#283;&nbsp;reprezentov&aacute;n: </p>

<ul>
<li>uzlem&nbsp;(na konci p&#283;&scaron;iny i mimo n&iacute;) &ndash; p&#345;ibli&#382;n&aacute; poloha objektu,</li>
<li>plochou&nbsp;(napojenou i nenapojenou na cestu) &ndash; zna&#269;&iacute;c&iacute; p&#345;esn&#283;j&scaron;&iacute; obrys fyzick&eacute;ho objektu,</li>
<li>relac&iacute;&nbsp;multipolygon&nbsp;(op&#283;t napojenou nebo jen &ldquo;pobl&iacute;&#382;&rdquo;) &ndash; zna&#269;&iacute;c&iacute; slo&#382;it&#283;j&scaron;&iacute; plochu .</li>

</ul>
<h3>2.1.2. API a dal&scaron;&iacute; slu&#382;by</h3>
<p>Samotn&aacute; datab&aacute;ze OpenStreetMap je hlavn&iacute; centralizovan&yacute; zdroj, do kter&eacute;ho se ukl&aacute;daj&iacute; v&scaron;echny editace. Aby bylo mo&#382;n&eacute; mapov&aacute; data d&aacute;le vyu&#382;&iacute;vat, existuje n&#283;kolik slu&#382;eb, kter&aacute; je poskytuj&iacute; navenek.</p>

<ul>
<li>API&nbsp;&ndash; obsahuje nej&#269;erstv&#283;j&scaron;&iacute; data a je ur&#269;eno pouze pro &uacute;&#269;ely editace. Um&iacute; vr&aacute;tit v&scaron;echna data v po&#382;adovan&eacute;m v&yacute;&#345;ezu\footnote{Vol&aacute;n&iacute; <a>http://api.openstreetmap.org/api/0.6/map?bbox=14.304,50.099,14.306,50.1</a>}&nbsp;a ulo&#382;it upraven&eacute; objekty zp&#283;t. Krom toho nab&iacute;z&iacute; zdroje&nbsp;pro pr&aacute;ci s histori&iacute;, changesety a u&#382;ivatelsk&yacute;mi profily. Komunikuje pomoc&iacute; OSM XML. Pro autentizaci pou&#382;&iacute;v&aacute; mimo jin&eacute; OAuth 1.0.&nbsp;V&iacute;ce na <a>wiki.osm.org/API</a></li>
<li>Planet dump&nbsp;&ndash; jednou t&yacute;dn&#283; prob&#283;hne export cel&eacute; datab&aacute;ze do form&aacute;tu OSM XML s kompres&iacute; bzip2 (osm.bz2) a Google protobuf form&aacute;tu (osm.pbf). K dispozici jsou dv&#283; verze: mapa bez historie (49 GiB, resp. 32 GiB) a s kompletn&iacute; histori&iacute; (75 GiB, resp. 51 GiB). T&eacute;&#382; se nab&iacute;z&iacute; r&#367;zn&eacute; zm&#283;nov&eacute; soubory (osc) v t&yacute;denn&iacute;m, denn&iacute;m i minutov&eacute;m rozsahu. V&iacute;ce na <a>planet.openstreetmap.org</a></li>
<li>Overpass API&nbsp;&ndash; rozhran&iacute; optimalizovan&eacute; na &#269;ten&iacute; data a vykon&aacute;v&aacute;n&iacute; i pom&#283;rn&#283; slo&#382;it&yacute;ch dotaz&#367;. Funguje v z&aacute;sad&#283; jako datab&aacute;ze p&#345;es protokol HTTP. Hod&iacute; se pro jednor&aacute;zov&eacute; exporty z&aacute;jmov&yacute;ch skupin prvk&#367; i pro pravideln&eacute; vyu&#382;it&iacute; pro backend&nbsp;r&#367;zn&yacute;ch webov&yacute;ch aplikac&iacute;. Umo&#382;&#328;uje dva dotazovac&iacute; jazyky a v&yacute;stup v OSM XML &#269;i JSON, bohu&#382;el chyb&iacute; p&#345;&iacute;m&aacute; podpora pro GeoJSON. <br>V&iacute;ce informac&iacute; na <a>wiki.osm.org/Overpass_API</a>, grafick&eacute; rozhran&iacute; na <a>overpass-turbo.eu</a></li>
<li>XAPI&nbsp;&ndash; kopie API pouze pro &#269;ten&iacute; s povolenou v&#283;t&scaron;&iacute; z&aacute;t&#283;&#382;&iacute;. Dnes nahrazena Overpassem.</li>
<li>Exporty&nbsp;&ndash; n&#283;kolik dal&scaron;&iacute;ch server&#367; nab&iacute;z&iacute; p&#345;edzpracovan&aacute; data z exportu Planet dump. Metro extracts nab&iacute;z&iacute; vy&#345;&iacute;znut&eacute; oblasti velk&yacute;ch m&#283;st<sup><a>[42]</a></sup>, Geofabrik.de nab&iacute;z&iacute; v&yacute;&#345;ezy pro jednotliv&eacute; kontinenty a st&aacute;ty<sup><a>[43]</a></sup>. </li>

</ul>
<h2>2.2. Editory</h2>
<p>Tak jako existuje mnoho slu&#382;eb, vzniklo komunitn&iacute;m v&yacute;vojem i p&#345;es des&iacute;tku editor&#367; pro &uacute;pravu OpenStreetMap. Pod&iacute;vejme se pouze na ty sou&#269;asn&eacute;, na jejich charakteristiky i p&#345;&iacute;padn&eacute; schopnosti tvo&#345;it indoor mapy.</p>
<h3>2.2.1. JOSM</h3>
<p>JOSM je pokro&#269;il&yacute; editor ur&#269;en&yacute; pro pokro&#269;il&eacute; u&#382;ivatele. Je postaven na platform&#283; Java, tak&#382;e jej&nbsp;lze spustit na v&scaron;ech opera&#269;n&iacute;ch syst&eacute;mech. V&yacute;voj za&#269;al v roce 2006 a od za&#269;&aacute;tku se vyzna&#269;oval velkou roz&scaron;i&#345;itelnost&iacute;. V sou&#269;asnosti &#269;&iacute;t&aacute; p&#345;es 200 plugin&#367;, 100 roz&scaron;&iacute;&#345;en&yacute;ch p&#345;edvoleb tagov&aacute;n&iacute; (presets) a mnoho vykreslovac&iacute;ch styl&#367;. Velikou nev&yacute;hodou je nep&#345;ehlednost u&#382;ivatelsk&eacute;ho rozhran&iacute;, proto nen&iacute; vhodn&yacute; pro za&#269;&aacute;te&#269;n&iacute;ky.</p>
<p>Vyu&#382;&iacute;v&aacute; spole&#269;n&yacute; editor-layer-index<sup><a>[44]</a></sup>&nbsp;pro definici mapov&yacute;ch a ortofoto vrstev, ze kter&yacute;ch je mo&#382;n&eacute; odvozovat data. Tam se krom&#283; server&#367; s glob&aacute;ln&iacute;m pokryt&iacute;m nach&aacute;z&iacute; i mnoho region&aacute;ln&iacute;ch, kter&eacute; jsou nab&iacute;dnuty podle aktu&aacute;ln&iacute;ho m&iacute;sta editace.</p>
<p>Vyzna&#269;uje se mo&#382;nost&iacute; pr&aacute;ce offline, a tedy i na&#269;&iacute;t&aacute;n&iacute; v&#283;t&scaron;&iacute;ch dataset&#367; &#269;i mnoha z&aacute;znam&#367; GPS trasy (GPX soubory). Krom&#283; na&#269;ten&iacute; klasick&eacute;ho v&yacute;&#345;ezu z API um&iacute; stahovat i jednotliv&eacute; prvky &#269;i kompletn&iacute; relace. Obsahuje tak&eacute; p&#345;&iacute;m&eacute; napojen&iacute; na Overpass API. Pomoc&iacute; plugin&#367; pak nap&#345;&iacute;klad na&#269;&iacute;t&aacute; fotky z otev&#345;en&eacute;ho street view Mapillary, &#269;i vykresluje v&yacute;&scaron;ky objekt&#367; dle metodiky Simple 3D.</p>
<p>Pro pohodln&#283;j&scaron;&iacute; editaci nab&iacute;z&iacute; mo&#382;nost vlastn&iacute;ho filtrov&aacute;n&iacute; dat dle zadan&eacute;ho dotazu. Tato vlastnost je z&aacute;kladn&iacute; funkcionalitou&nbsp;nutnou&nbsp;pro indoor mapov&aacute;n&iacute;. Tagovac&iacute; p&#345;edvolby a vykreslovac&iacute; styly pro n&#283;kter&eacute; indoor metodiky jsou&nbsp;ji&#382;&nbsp;tak&eacute; k dispozici, p&#345;&iacute;padn&#283; je mo&#382;n&eacute; je snadno vytvo&#345;it.</p>
<p><img></p>
<p>Obr&aacute;zek23: Editor JOSM</p>
<h3>2.2.2. Potlatch2</h3>
<p>Online webov&yacute; editor na platform&#283; Flash, kter&yacute; byl v aktivn&iacute;m v&yacute;voji 2009&ndash;2013. Na vlastn&iacute;m vykreslovac&iacute;m j&aacute;d&#345;e um&iacute; svi&#382;n&#283; zobrazovat i editovat data a disponuje i n&#283;kolika pokro&#269;il&yacute;mi funkcemi. Nyn&iacute; ji&#382; je na &uacute;stupu, nebo&#357; neumo&#382;&#328;uje tak snadnou roz&scaron;i&#345;itelnost a proto&#382;e technologie Flash p&#345;est&aacute;v&aacute; b&yacute;t podporov&aacute;na ve prosp&#283;ch HTML5.</p>
<p>Pro indoor mapov&aacute;n&iacute;&nbsp;nem&aacute; podporu &ndash; vykresluje prvky v&scaron;ech pater sou&#269;asn&#283;.</p>
<p><img></p>
<p>Obr&aacute;zek24: Editor Potlatch2 s rozbalenou nab&iacute;dkou podklad&#367;</p>

<h3>2.2.3. Editor iD</h3>
<p>Nov&yacute; webov&yacute; editor iD je postaven na technologi&iacute;ch HTML5. &Uacute;sil&iacute; za&#269;alo v roce 2012, kdy byl podpo&#345;en grantem Knights foundation<sup><a>[45]</a></sup>&nbsp;a v&yacute;voj koordinov&aacute;n spole&#269;nost&iacute; MapBox. Hlavn&iacute; v&yacute;voj prob&iacute;hal v roce 2013, kdy byl i nasazen jako v&yacute;choz&iacute; editor na str&aacute;nce openstreetmap.org.</p>
<p>iD je narozd&iacute;l od ostatn&iacute;ch editor&#367; navr&#382;en zejm&eacute;na s ohledem na jednoduchost pou&#382;it&iacute;. Po spu&scaron;t&#283;n&iacute; u&#382;ivateli nab&iacute;dne interaktivn&iacute; komentovanou prohl&iacute;dku z&aacute;klad&#367; editace. Z&#345;eteln&#283; odli&scaron;uje kreslic&iacute; a prohl&iacute;&#382;ec&iacute; m&oacute;dy a nab&iacute;z&iacute; bohat&eacute; formul&aacute;&#345;e s p&#345;ednastaven&yacute;m tagov&aacute;n&iacute; (presets). V re&#382;imu p&#345;&iacute;m&eacute;ho zad&aacute;v&aacute;n&iacute; tag&#367; pak nab&iacute;z&iacute; ji&#382; existuj&iacute;c&iacute; tagy dle datab&aacute;ze taginfo.</p>
<p><img></p>
<p>Obr&aacute;zek25: Editor iD s vybran&yacute;m uzlem rozcesn&iacute;ku</p>
<p>Z technologi&iacute; HTML5 vyu&#382;&iacute;v&aacute; pokro&#269;ilou vizualiza&#269;n&iacute; knihovnu d3.js. Vykreslen&iacute; p&#345;enech&aacute;v&aacute; na inline SVG, kter&eacute; lze v&yacute;hodn&#283; stylovat pomoc&iacute; klasick&eacute;ho CSS3. D&iacute;ky tomu lze editoru snadno upravovat chov&aacute;n&iacute; za b&#283;hu a vyv&iacute;jet nov&eacute; vlastnosti (tzv. hackable editor).</p>
<p>Pro indoor mapov&aacute;n&iacute; nem&aacute; podporu &ndash; vykresluje v&scaron;echny prvky v&scaron;ech pater sou&#269;asn&#283;.</p>
<h2>2.3. Indoor v OSM</h2>
<p>Jak ji&#382; bylo nazna&#269;eno v &uacute;vodu t&eacute;to kapitoly, indoor mapov&aacute;n&iacute; v OpenStreetMap u&#382; pro&scaron;lo ur&#269;it&yacute;m v&yacute;vojem. Vzniklo n&#283;kolik n&aacute;vrh&#367;, kter&eacute; byly&nbsp;vyzkou&scaron;eny v praxi, prob&#283;hlo n&#283;kolik pokus&#367; o tvorbu editoru a neposledn&#283; byly&nbsp;zmapov&aacute;ny&nbsp;stovky budov po cel&eacute;m sv&#283;t&#283; (a&#269;koliv, s trochou nads&aacute;zky, ka&#382;d&aacute; m&iacute;rn&#283; jinou metodikou).</p>
<p>Tato pr&aacute;ce se nesna&#382;&iacute; o nalezen&iacute; zcela nov&eacute;ho zp&#367;sobu tagov&aacute;n&iacute;, ale stav&iacute; na tom,&nbsp;co je dob&#345;e navr&#382;eno,&nbsp;a p&#345;id&aacute;v&aacute; i ub&iacute;r&aacute; tak, aby byl v&yacute;sledek pro komunitu&nbsp;p&#345;ijateln&yacute;.</p>
<h3>2.3.1. V&yacute;zvy pro indoor mapov&aacute;n&iacute;</h3>
<p>Architektura OpenStreetMap je navr&#382;en&aacute; velmi flexibiln&#283; a nem&aacute; pot&iacute;&#382; se za&#269;len&#283;n&iacute;m indoor dat. Existuj&iacute; v&scaron;ak n&#283;kter&eacute; technick&eacute; i netechnick&eacute; v&yacute;zvy, kter&eacute; je dobr&eacute; promyslet. Na OSM wiki<sup><a>[46]</a></sup>&nbsp;je sepsal u&#382;ivatel Dave Sutter.</p>

<ol>
<li>Data jsou sv&yacute;m charakterem trochu jin&aacute; &ndash; nekresl&iacute; se v jedn&eacute; vrstv&#283;, ale ka&#382;d&eacute; patro m&aacute; svou vrstvu. Naopak klasick&eacute; 2D mapy jsou nyn&iacute; ploch&eacute;, zobrazuj&iacute; v&scaron;e v jedn&eacute; vrstv&#283;. V p&#345;&iacute;pad&#283; bod&#367; z&aacute;jmu to m&#367;&#382;e b&yacute;t &#382;&aacute;douc&iacute;, pokud jich nen&iacute; mnoho na stejn&yacute;ch sou&#345;adnic&iacute;ch, ov&scaron;em v p&#345;&iacute;pad&#283; p&#345;ekryt&iacute; m&iacute;rn&#283; odli&scaron;n&yacute;ch komunikac&iacute;&nbsp;vznikne nesrozumiteln&yacute; v&yacute;stup. Zp&#367;sobeno je to tak&eacute; t&iacute;m, &#382;e pro n&#283;kter&eacute; indoor i venkovn&iacute; prvky (nap&#345;&iacute;klad chodn&iacute;k) se pou&#382;&iacute;v&aacute; stejn&eacute; tagov&aacute;n&iacute;, tak&#382;e renderer je vykresl&iacute; v obou p&#345;&iacute;padech. <br>Editory v&#382;dy vykresluj&iacute; v&scaron;echna data, tak&#382;e probl&eacute;m je je&scaron;t&#283; markantn&#283;j&scaron;&iacute;.</li>
<li>Business listingy se, obzvl&aacute;&scaron;&#357; v n&aacute;kupn&iacute;ch centrech, mohou &#269;asto m&#283;nit, geometrie v&scaron;ak z&#367;st&aacute;v&aacute;. Tento bod adresuje obecn&#283;j&scaron;&iacute; probl&eacute;m, jak se m&aacute; OSM postavit ke katalogizaci firem. V ide&aacute;ln&iacute;m p&#345;&iacute;pad&#283; by existoval voln&yacute; katalog firem se v&scaron;emi &uacute;daji, otv&iacute;rac&iacute; dobou apod. a v OSM by byla ulo&#382;ena&nbsp;jen geometrie + prolinkov&aacute;n&iacute; do katalogu. Ov&scaron;em nad&#283;je na vznik podobn&eacute;ho katalogu jsou miziv&eacute;.</li>
<li>Pr&aacute;vn&iacute; d&#367;sledky &ndash; mapov&aacute;n&iacute; ve&#345;ejn&eacute;ho prostoru je v po&#345;&aacute;dku, nap&#345;&iacute;klad n&aacute;kupn&iacute; centra ale b&yacute;vaj&iacute; vlastn&#283;na soukrom&yacute;mi subjekty a k z&iacute;sk&aacute;v&aacute;n&iacute; dat je vhodn&yacute; souhlas. </li>
<li>Do&#269;asn&eacute; mapy &ndash; nap&#345;&iacute;klad pro r&#367;zn&aacute; v&yacute;stavi&scaron;t&#283; je typick&eacute;, &#382;e ka&#382;doro&#269;n&#283; stav&iacute; stejn&eacute; sch&eacute;ma pro jeden konkr&eacute;tn&iacute; veletrh. V tuto chv&iacute;li nen&iacute; vhodn&yacute; zp&#367;sob jak tuto informaci do OSM ulo&#382;it. Pokud se geometrie v datab&aacute;zi zanechaj&iacute; s jin&yacute;mi tagy a p&#345;es n&#283; se budou kreslit data pro &ldquo;aktu&aacute;ln&iacute; veletrh&rdquo;, bude v datab&aacute;zi nep&#345;ehledn&aacute; zm&#283;&#357; &#269;ar. Toto je op&#283;t v&yacute;zva pro editory i mapov&eacute; v&yacute;stupy.</li>

</ol>
<h3>2.3.2. D&#345;&iacute;v&#283;j&scaron;&iacute; pokusy</h3>
<p>Abychom se mohli pou&#269;it z p&#345;edchoz&iacute;ch n&aacute;vrh&#367;, poj&#271;me si je shrnout. D&iacute;ky tomu, &#382;e v&nbsp;OSM je mo&#382;n&eacute; pou&#382;&iacute;vat i neschv&aacute;len&eacute; tagov&aacute;n&iacute;, mohli auto&#345;i vytvo&#345;it mnoho p&#345;&iacute;klad&#367; pou&#382;it&iacute;.</p>
<h4>2.3.2.1. Level relation &ndash; 5/2009</h4>
<p>Jedn&aacute; se o kr&aacute;tk&yacute; n&aacute;vrh na vytvo&#345;en&iacute; relace sdru&#382;uj&iacute;c&iacute; v&scaron;echny objekty na jednom pat&#345;e s t&iacute;m, &#382;e v&iacute;cepatrov&eacute; budou m&iacute;t p&#345;&iacute;slu&scaron;nost k v&iacute;ce relac&iacute;m. Tento koncept se opakuje i v n&aacute;sleduj&iacute;c&iacute;ch n&aacute;vrz&iacute;ch.&nbsp;Uv&aacute;d&iacute; tak&eacute; z&aacute;klad tagu level=*&nbsp;s v&yacute;znamem level=0&nbsp;jako p&#345;&iacute;zem&iacute; a mo&#382;nost&iacute; tagov&aacute;n&iacute; mezipater desetinn&yacute;m &#269;&iacute;slem.</p>
<p>K dispozici na: <a>wiki.osm.org/Relations/Proposed/Level</a>&nbsp;</p>
<h4>2.3.2.2. Indoor by saerdnaer &ndash; 3/2011</h4>
<p>Komplexn&#283;j&scaron;&iacute; n&aacute;vrh z Technick&eacute; univerzity v Mnichov&#283; op&#283;t vyu&#382;&iacute;v&aacute; relace pro jednotliv&aacute; patra, ale zav&aacute;d&iacute; i n&#283;kter&eacute; dal&scaron;&iacute; u&#382;ite&#269;n&eacute; koncepty. </p>
<p><img><img></p>
<p>Obr&aacute;zek26ab: Desetinn&yacute; level u schod&#367; (a); p&#345;ehled relac&iacute; pater (b)<sup><a>[47]</a></sup></p>
<p>Jednotliv&eacute; m&iacute;stnosti ozna&#269;uje plochami s tagem room=*, kde se vyu&#382;&iacute;v&aacute; rozli&scaron;en&iacute; typ&#367; dle SIG3D (sou&#269;&aacute;st CityGML &ndash; viz kapitola 1.1.8). D&aacute;le vyu&#382;&iacute;v&aacute; ji&#382; dob&#345;e ustanoven&eacute; tagy: ref=*&nbsp;pro &#269;&iacute;slo m&iacute;stnosti, entrance=*&nbsp;pro vchody a access=*&nbsp;pro omezen&iacute; vstupu. </p>
<p>Chodby nemodeluje jako plochy, ale liniov&#283; veden&eacute; cesty s nov&yacute;m tagem highway=corridor. Tak je to v OSM zvykem a z&aacute;rove&#328; je t&iacute;m tvo&#345;en routovac&iacute; graf. Pro venkovn&iacute; veden&iacute; p&#345;id&aacute;v&aacute; outdoor=yes.</p>
<p>Pro level=*&nbsp;ukazuje, jak by mohlo b&yacute;t tagov&aacute;no schodi&scaron;t&#283;, zejm&eacute;na v p&#345;&iacute;pad&#283;, &#382;e na r&#367;zn&yacute;ch odpo&#269;&iacute;vadlech vedou dve&#345;e jinam. Krom&#283; uv&aacute;d&#283;n&iacute; levelu&nbsp;v relac&iacute;ch tak&eacute; uv&aacute;d&iacute; alespo&#328; jeden level=*&nbsp;u samotn&eacute;ho prvku.</p>
<p>K dipozici na: <a>wiki.osm.org/Proposed_features/indoor</a>&nbsp;pouze v n&#283;meck&eacute;m jazyce</p>
<p>Na&scaron;e hodnocen&iacute;:&nbsp;Dob&#345;e zpracovan&yacute; n&aacute;vrh, kter&yacute; u&#382; je nahrazen jin&yacute;mi. Vyu&#382;&iacute;val princip&#367; OSM (uzly, cesty) a existuj&iacute;c&iacute;ch tag&#367; (access, &hellip;), m&#283;l p&#345;esah do CityGML a vyu&#382;&iacute;val pokro&#269;ilej&scaron;&iacute;ch vlastnost&iacute; tagu level, kter&yacute; i p&#345;en&aacute;&scaron;el na jednotliv&eacute; prvky.</p>
<h4>2.3.2.3. Level_map &ndash; 9/2011</h4>
<p>Zcela vy&#269;erp&aacute;vaj&iacute;c&iacute; n&aacute;vrh&nbsp;&#269;&iacute;taj&iacute;c&iacute; 8 stran textu popisuje pom&#283;rn&#283; slo&#382;it&yacute; syst&eacute;m vyu&#382;it&iacute; relac&iacute; a rol&iacute;. Vyu&#382;&iacute;v&aacute; t&eacute;&#382; mo&#382;nosti replikace objekt&#367;, kter&eacute; se nach&aacute;z&iacute; ve v&iacute;ce patrech na stejn&eacute;m m&iacute;st&#283; (nap&#345;. chodba, toalety). Objekt je pak v OSM datab&aacute;zi jen jednou, ale je p&#345;i&#345;azen do v&iacute;ce pater.</p>
<p>Jeho hlavn&iacute;m stavebn&iacute;m kamenem je relace type=level_map. P&#345;i&#345;azuje uspo&#345;&aacute;dan&yacute; seznam ID pater v objektu do tagu levels=*, nap&#345;. levels=B;G;1-3&nbsp;(pro Basement, Ground floor a patra). Zde nab&iacute;z&iacute; i mo&#382;nost roz&scaron;&iacute;&#345;en&eacute;ho pojmenov&aacute;n&iacute; pater pomoc&iacute; levels=B=Basement;&hellip;&nbsp;&#269;i specifikaci v&yacute;&scaron;ky v metrech a dal&scaron;&iacute;ch jazykov&yacute;ch p&#345;eklad&#367;.</p>
<p>V&scaron;echny objekty v budov&#283; jsou&nbsp;pak &#269;leny t&eacute;to relace a jejich role ud&aacute;v&aacute; patro. N&aacute;vrh&nbsp;nab&iacute;z&iacute; i speci&aacute;ln&iacute; role pro spojen&iacute; v&iacute;ce pater (schodi&scaron;t&#283;) &#269;i dokonce mo&#382;nost definovat nov&eacute; pojmenovan&eacute;&nbsp;role s pokro&#269;il&yacute;mi mo&#382;nostmi. Do rol&iacute; t&eacute;&#382; navrhuje ps&aacute;t mo&#382;n&eacute; odli&scaron;nosti v tagov&aacute;n&iacute; objektu v r&#367;zn&yacute;ch patrech, nap&#345;. role:Toilets=B;3[female=yes;male=no];4[female=no;male=yes].</p>
<p>K dipozici na: <a>wiki.osm.org/Relations/Proposed/Level_Map</a></p>
<p>Na&scaron;e hodnocen&iacute;: n&aacute;vrh nen&iacute; vhodn&yacute;, kv&#367;li sv&eacute; slo&#382;itosti. Vytv&aacute;&#345;&iacute; zbyte&#269;n&#283; n&#283;kolik nov&yacute;ch syntax&iacute; uvnit&#345; (textov&eacute;ho) tagu, zav&aacute;d&iacute; identifik&aacute;tory pro slo&#382;it&#283;j&scaron;&iacute; popis rol&iacute; a nevyu&#382;&iacute;v&aacute; tedy dob&#345;e existuj&iacute;c&iacute; architekturu prvk&#367; a tag&#367;. Implementace editoru i prohl&iacute;&#382;e&#269;e by byla velmi n&aacute;ro&#269;n&aacute;.</p>
<h4>2.3.2.4. IndoorOSM &ndash; 11/2011</h4>
<p>Jeden z &uacute;sp&#283;&scaron;n&#283;j&scaron;&iacute;ch n&aacute;vrh&#367;&nbsp;z Universit&auml;t Heidelberg<sup><a>[48]</a></sup>&nbsp;dal za vznik i editoru a prohl&iacute;&#382;e&#269;i. V sou&#269;asn&eacute; dob&#283; je zam&iacute;tnut&yacute; ve prosp&#283;ch Simple Indoor Tagging.</p>
<p>Definuje jednu hlavn&iacute; relaci pro budovu type=building, kter&aacute; sdru&#382;uje podrelace pater a z&aacute;rove&#328; obsahuje dal&scaron;&iacute; informace o budov&#283;, v&#269;etn&#283; n&#283;kter&yacute;ch navr&#382;en&yacute;ch vlastnost&iacute; pro 3D vzhled. Samotn&aacute; relace patra type=level&nbsp;pak ud&aacute;v&aacute; &#269;&iacute;slo i jm&eacute;no patra a sdru&#382;uje jednotliv&eacute; objekty. </p>
<p><img></p>
<p>Obr&aacute;zek27: Relace budovy a jej&iacute; podrelace<sup><a>[49]</a></sup></p>
<p>V&scaron;echny indoor objekty (pokoje, chodby, atd.) navrhuje tagovat jako buildingpart=*, nap&#345;. buildingpart=room&nbsp;apod. a t&eacute;&#382; je um&iacute;stit do relace patra v roli buildingpart. Dve&#345;e a okna jsou zvoleny jako uzly s mo&#382;nost&iacute; vyplnit &scaron;&iacute;&#345;ku, v&yacute;&scaron;ku, omezen&iacute; vstupu apod. Prvky maj&iacute; definov&aacute;no patro pouze p&#345;es p&#345;&iacute;slu&scaron;nost k relaci, tag level=*&nbsp;na nich tedy nen&iacute; vy&#382;adov&aacute;n.</p>
<p>Propojen&iacute; mezi patry je &#345;e&scaron;eno netradi&#269;n&iacute;m zp&#367;sobem. Ka&#382;d&yacute; prvek, kter&yacute; se propojuje do jin&eacute;ho patra, m&aacute; na sob&#283; tag s ID uzlu &ldquo;kam je mo&#382;n&eacute; j&iacute;t&rdquo;, nap&#345;. connector:ids=67890. Tento &ldquo;connector&rdquo; je tedy jednosm&#283;rn&aacute; informace pro routing. Pokud by &scaron;lo o schodi&scaron;t&#283;, tedy obousm&#283;rn&yacute; segment, bylo by nutn&eacute; v&#382;dy vz&aacute;jemn&#283; referencovat uzly v patrech nad sebou.</p>
<p>D&iacute;ky v&#283;t&scaron;&iacute; aktivit&#283; t&yacute;mu z univerzity i dal&scaron;&iacute;ch zapojen&yacute;ch lid&iacute; ji&#382; bylo otagov&aacute;no velk&eacute; mno&#382;stv&iacute; budov nejen v N&#283;mecku (dle taginfo existuje t&eacute;m&#283;&#345; 6&nbsp;000 relac&iacute; type=building<sup><a>[50]</a></sup>) a vznikla &#345;ada n&aacute;stroj&#367;. Pod&iacute;vejme se na n&#283;kter&eacute; z nich:</p>

<ul>
<li>javascriptov&yacute; prohl&iacute;&#382;e&#269; postaven&yacute; na Overpass API\footnote{<a>http://clement-lagrange.github.io/osmtools-indoor/</a>},</li>
<li>Indoor 3D &ndash; prohl&iacute;&#382;e&#269; indoor dat na syst&eacute;mu OSMBuildings\footnote{<a>osmbuildings.org/indoor</a>},</li>
<li>univerzitn&iacute; 2D i 3D prohl&iacute;&#382;e&#269;\footnote{<a>http://indoorosm.uni-hd.de/</a>&nbsp;a <a>http://indoorosm.uni-hd.de/3d/</a>},</li>
<li>simul&aacute;tor evakuace budovy v prost&#345;ed&iacute; MATSim,</li>
<li>N&aacute;vod na editaci v editoru JOSM na str&aacute;nce n&aacute;vrhu.</li>

</ul>
<p>K dipozici na: <a>wiki.osm.org/IndoorOSM</a></p>
<p>Na&scaron;e hodnocen&iacute;:&nbsp;Tento n&aacute;vrh&nbsp;komplexn&#283; &#345;e&scaron;&iacute; problematiku indoor mapov&aacute;n&iacute;, uva&#382;uje nad mo&#382;nost&iacute; vykreslov&aacute;n&iacute; ve 3D i navigac&iacute;. Zad&aacute;v&aacute;n&iacute; pomoc&iacute; relac&iacute; nen&iacute; snadn&eacute;, ale je mo&#382;n&eacute;, jak se i prok&aacute;zalo prax&iacute;. Hlavn&iacute; nev&yacute;hodou je referencov&aacute;n&iacute; ID uzl&#367;, to auto&#345;i pozd&#283;ji sami ozna&#269;ili za nevhodn&eacute;, nebo&#357; toto ID se m&#367;&#382;e m&#283;nit. Jist&aacute; nev&yacute;hoda m&#367;&#382;e&nbsp;t&eacute;&#382;&nbsp;plynout ze zam&#283;nitelnosti tagu buildingpart&nbsp;s building:part, kter&yacute; je pou&#382;&iacute;van&yacute; pro metodiku Simple 3D buildings.<sup><a>[51]</a></sup></p>
<h4>2.3.2.5. Compound facility &ndash; 11/2013</h4>
<p>Tento n&aacute;vrh z Budapest University of Technology and Economics vznikl zejm&eacute;na pro pot&#345;ebu navigace cestuj&iacute;c&iacute;ch v r&aacute;mci rozs&aacute;hl&yacute;ch stanic. Univerzitn&iacute; t&yacute;m p&#345;ipravoval multimod&aacute;ln&iacute; pl&aacute;nova&#269; tras a tento n&aacute;vrh&nbsp;m&#283;l nastavit metodiku, jak tagovat indoor mapy s ohledem na slo&#382;it&#283;j&scaron;&iacute; modely pater a hled&aacute;n&iacute; tras v napojen&yacute;ch ploch&aacute;ch.</p>
<p>Navrhuje podobn&yacute; syst&eacute;m relac&iacute; jako IndoorOSM. Hlavn&iacute; relace (type=compound_facility) sdru&#382;uje v&scaron;echny vchody a podrelace jednotliv&yacute;ch pater (type=level). Patra nejsou prim&aacute;rn&#283; organizov&aacute;na tagem level=*, ale nov&yacute;m tagem zlevel=*. Ten m&aacute; &#269;&iacute;slovat jednotliv&eacute; z-roviny, proto&#382;e na n&aacute;dra&#382;&iacute;ch patra &#269;asto nejsou jednozna&#269;n&#283; rozli&scaron;iteln&aacute;. </p>
<p>Nov&#283; p&#345;id&aacute;v&aacute; relaci type=convex_area, kter&aacute; v konvexn&iacute;ch ploch&aacute;ch umo&#382;&#328;uje zad&aacute;vat referene&#269;n&iacute; body pro routing (jinak je hled&aacute;n&iacute; vhodn&eacute; p&#283;&scaron;&iacute; trasy v plo&scaron;n&eacute;m objektu chodby pom&#283;rn&#283; n&aacute;ro&#269;n&eacute;).</p>
<p>Spojen&iacute; mezi patry modeluje dal&scaron;&iacute; relac&iacute; type=level_connector&nbsp;se dv&#283;ma rolemi: from&nbsp;a to. </p>
<p>Sou&#269;&aacute;st&iacute; n&aacute;vrhu je i uk&aacute;zka mapov&aacute;n&iacute; v JOSM a dostupn&aacute; uk&aacute;zkov&aacute; data pro jedno n&aacute;dra&#382;&iacute;. Ov&scaron;em data nikdy nebyla vlo&#382;ena do OSM a z&#345;ejm&#283; poslou&#382;ila jen pro teoretick&eacute; &uacute;&#269;ely.</p>
<p>K dipozici na: <a>wiki.osm.org/Proposed_features/CompoundFacility</a></p>
<p>Na&scaron;e hodnocen&iacute;:&nbsp;N&aacute;vrh op&#283;t (nad)u&#382;&iacute;v&aacute; relac&iacute;, nen&iacute; vhodn&yacute; pro snadn&eacute; mapov&aacute;n&iacute;. M&iacute;sto zlevel=*&nbsp;lze v&yacute;hodn&#283;ji pou&#382;&iacute;t desetinn&aacute; m&iacute;sta pro tag level=*. Zaj&iacute;mav&aacute; je my&scaron;lenka s referen&#269;n&iacute;mi body v slo&#382;it&yacute;ch ploch&aacute;ch, ov&scaron;em i to lze &#345;e&scaron;it &ldquo;chyt&#345;e&rdquo; &#269;ist&#283; algoritmicky.</p>
<h4>2.3.2.6. Simple Indoor Tagging &ndash; 6/2014</h4>
<p>Nejnov&#283;j&scaron;&iacute; n&aacute;vrh z komunity je v mnoh&eacute;m p&#345;evratn&yacute;. Upustil od pou&#382;&iacute;v&aacute;n&iacute; relac&iacute; a m&iacute;sto toho pouze v&scaron;ude striktn&#283; dopl&#328;uje tag level=*. Spr&aacute;vn&#283; podot&yacute;k&aacute;, &#382;e typick&yacute; v&yacute;voj mapy v OSM za&#269;&iacute;n&aacute; na &ldquo;p&#345;ibli&#382;n&eacute;m odhadu&rdquo; a kon&#269;&iacute; &ldquo;&scaron;&iacute;lenou detailnost&iacute;&rdquo;. T&eacute;&#382; je dob&#345;e kompatibiln&iacute; s metodikou Simple 3D.</p>
<p><img><img></p>
<p>Obr&aacute;zek28ab: Jednoduch&eacute; tagov&aacute;n&iacute; bod&#367; z&aacute;jmu (a); detailn&iacute; tagov&aacute;n&iacute; m&iacute;stnost&iacute; (b)<sup><a>[52]</a></sup></p>
<p>Pro jednoduch&eacute; mapov&aacute;n&iacute; bod&#367; z&aacute;jmu tedy navrhuje pouze p&#345;idat na obrys budovy tagy min_level=*&nbsp;a max_level=*, kter&eacute; ur&#269;&iacute; v&scaron;echna patra budovy. Jednotliv&eacute; uzly uvnit&#345; pak maj&iacute; pouze nastaven&yacute; level=*. &nbsp;Patra by m&#283;la korespondovat s ozna&#269;en&iacute;m patra v budov&#283;. Typicky level=0&nbsp;znamen&aacute; p&#345;&iacute;zem&iacute;, ale nemus&iacute; tomu tak b&yacute;t. Pokud v budov&#283; n&#283;kter&eacute; patro chyb&iacute;, m&#367;&#382;e to b&yacute;t ozna&#269;eno tagem non_existent_levels=*. &nbsp;Zcela odeb&iacute;r&aacute; nutnost pou&#382;&iacute;v&aacute;n&iacute; relac&iacute;, ale nezabra&#328;uje jejich vyu&#382;it&iacute; pro seskupen&iacute; budovy a patra.</p>
<p>Navrhuje komplexn&#283;j&scaron;&iacute; mapov&aacute;n&iacute; vnit&#345;n&iacute;ch prostor pomoc&iacute; tagu indoor=*,&nbsp;nap&#345;&iacute;klad pokoj indoor=room&nbsp;m&aacute; implicitn&#283; st&#283;ny, zat&iacute;mco chodba indoor=corridor&nbsp;&#269;i jin&aacute; plocha&nbsp;indoor=area&nbsp;st&#283;ny nem&aacute;. St&#283;ny lze tak&eacute; doplnit samostatn&#283; pomoc&iacute; indoor=wall. Tak je mo&#382;n&eacute; pokr&yacute;t cel&eacute; &uacute;zem&iacute; patra a modelovat v&scaron;e dle pot&#345;eby. K ozna&#269;en&iacute; &#269;&iacute;sla m&iacute;stnosti slou&#382;&iacute; tag ref=*, n&aacute;zev klasicky name=*.</p>
<p>Spojen&iacute; mezi patry je navr&#382;eno plochou, kter&aacute; se rozkl&aacute;d&aacute; p&#345;es v&iacute;ce pater (nap&#345; level=0-3). Ka&#382;d&eacute; patro je pak napojeno pr&#367;chodem (door=yes&nbsp;+ level=0). Routov&aacute;n&iacute; je tedy umo&#382;n&#283;no p&#345;es v&scaron;echny dotyky ploch beze st&#283;n a t&eacute;&#382; v&scaron;emi pr&#367;chody.</p>
<p>Dodate&#269;n&eacute; informace o patru je mo&#382;n&eacute; zad&aacute;vat k obrysu patra s tagem indoor=level, tam lze snadno propojit &#269;&iacute;slo patra level=*&nbsp;s jeho pojmenov&aacute;n&iacute;m name=*, v&yacute;&scaron;kou height=*&nbsp;a pota&#382;mo dal&scaron;&iacute;mi 3D vlastnostmi.</p>
<p>Ve v&yacute;&scaron;kov&yacute;ch budov&aacute;ch se &#269;asto rozlo&#382;en&iacute; chodeb, dve&#345;&iacute; a dal&scaron;&iacute;ch prvk&#367; opakuje. I na to auto&#345;i mysleli. Ka&#382;d&yacute; indoor prvek, kter&yacute; m&aacute; definov&aacute;no patro, m&#367;&#382;e m&iacute;t i tag repeat_on=*, kter&yacute; zna&#269;&iacute; patra, ve kter&yacute;ch je jeho &uacute;pln&aacute; kopie. (Zde do&scaron;lo v pr&#367;b&#283;hu psan&iacute; pr&aacute;ce ke zm&#283;n&#283; &ndash; tag level=*&nbsp;mus&iacute; b&yacute;t p&#345;&iacute;tomen v&#382;dy.)</p>
<p>Metodika se d&iacute;ky jednoduchosti ujala, ale je&scaron;t&#283; nen&iacute; pova&#382;ov&aacute;na za fin&aacute;ln&iacute; a tedy ani neza&#269;al proces hlasov&aacute;n&iacute;. V prvn&iacute; p&#367;lce roku 2015 vytvo&#345;il u&#382;ivatel Panier Avide prohl&iacute;&#382;e&#269; postaven&yacute; na Overpass API &ndash; <a>openlevelup.net</a>. Indoor editor vznikl v dob&#283; dokon&#269;ov&aacute;n&iacute; t&eacute;to pr&aacute;ce.</p>
<p>K dipozici na: <a>wiki.osm.org/Simple_Indoor_Tagging</a></p>
<p>Na&scaron;e hodnocen&iacute;:&nbsp;Tento n&aacute;vrh&nbsp;je vhodn&yacute; k n&aacute;sledov&aacute;n&iacute;, nebo&#357; respektuje&nbsp;filozofii OSM s mo&#382;nost&iacute; postupn&eacute;ho zlep&scaron;ov&aacute;n&iacute; zmapovanosti. Nejl&eacute;pe ze v&scaron;ech vyu&#382;&iacute;v&aacute; existuj&iacute;c&iacute; architekturu a nevytv&aacute;&#345;&iacute; komplikovan&eacute; relace. M&iacute;sto striktn&iacute;ho &ldquo;flexibiln&iacute;ho&rdquo; odd&#283;len&iacute; pater relacemi vyu&#382;&iacute;v&aacute; faktu, &#382;e patra jsou zkr&aacute;tka p&#345;irozen&aacute; &#269;&iacute;sla a tedy je nen&iacute; t&#345;eba nikde zvl&aacute;&scaron;&#357; definovat. <br>Spojen&iacute; pater p&#345;irozen&#283; modeluje nap&#345;&iacute;klad v&yacute;tahovou &scaron;achtu &ndash; ov&scaron;em pro schodi&scaron;t&#283; chyb&iacute; mo&#382;nosti informace o veden&iacute; schod&#367;.</p>
<h4>2.3.2.7. Pozn&aacute;mka k tagu level=*</h4>
<p>V z&aacute;v&#283;ru roku 2011 se s pon&#283;kud nejist&yacute;m procesem objevila str&aacute;nka o tagu level=*, nejd&#345;&iacute;ve pouze odkazovala na n&aacute;vrhy, kter&eacute; ho vyu&#382;&iacute;valy. Ov&scaron;em p&#345;i postupn&eacute;m dopl&#328;ov&aacute;n&iacute; se z n&iacute; stala &ldquo;uznan&aacute; vlastnost&rdquo;. Nejsp&iacute;&scaron;e je to d&aacute;no jej&iacute; jednoduchost&iacute; a t&iacute;m, &#382;e tag je intuitivn&#283; pou&#382;&iacute;van&yacute;. V sou&#269;asnosti m&aacute; t&eacute;m&#283;&#345; 300 000 v&yacute;skyt&#367;.</p>
<h3>2.3.3. V&yacute;sledn&aacute; metodika pro indoor mapy</h3>
<p>Na&scaron;e &#345;e&scaron;en&iacute; v principu p&#345;&iacute;mo&nbsp;vych&aacute;z&iacute; ze Simple Indoor Tagging, ale chceme navrhnout jak&eacute;si j&aacute;dro indoor tagov&aacute;n&iacute;, kter&eacute; nech&aacute; v&#283;t&scaron;&iacute; volnost ve volb&#283; indoor prvk&#367;. Zejm&eacute;na dopl&#328;ujeme robustn&#283;j&scaron;&iacute; variantu modelu level=*&nbsp;a repeat_on=*&nbsp;a adresujeme n&#283;kter&eacute; dal&scaron;&iacute; pot&iacute;&#382;e.</p>
<h4>Budovy</h4>

<ul>
<li>U budov (building=yes) i &#269;&aacute;st&iacute; budov (building:part=yes) se zachov&aacute;v&aacute; min_level=*&nbsp;a max_level=*. T&eacute;&#382; p&#345;&iacute;padn&eacute; non_existent_levels=*.</li>

</ul>
<p><img>&nbsp; &nbsp; <img></p>
<p>Obr&aacute;zek29ab: Vyu&#382;it&iacute; tagu level a repeat_on (a); mezipatra pomoc&iacute; desetinn&eacute;ho &#269;&iacute;sla (b)</p>
<h4>Patra</h4>

<ul>
<li>Obt&iacute;&#382;nou situac&iacute; v OSM je, &#382;e form&aacute;t level=*&nbsp;mus&iacute; b&yacute;t srozumiteln&yacute; pro lidi,&nbsp;aby ho dok&aacute;zali intuitivn&#283; zad&aacute;vat, a z&aacute;rove&#328; b&yacute;t samostatn&#283; srozumiteln&yacute; i pro po&#269;&iacute;ta&#269;e, aby bylo mo&#382;n&eacute; patra se&#345;adit, a tak vykreslit. Souhlas&iacute;me tedy se Simple Indoor, kter&yacute; navrhuje ozna&#269;ov&aacute;n&iacute; pater odpov&iacute;daj&iacute;c&iacute;m &#269;&iacute;slem, nap&#345;. v budov&#283; s patry S, P, 1, 2, bude patro &ldquo;S&rdquo; odpov&iacute;dat level=-1&nbsp;a patro &ldquo;P&rdquo; level=0. </li>
<li>Ozna&#269;en&iacute; pater je umo&#382;n&#283;no i v desetinn&eacute;m form&aacute;tu (viz obr&aacute;zek). To je vhodn&eacute; pro tzv. mezaninov&eacute; prostory a t&eacute;&#382; t&#345;eba pro lep&scaron;&iacute; veden&iacute; schod&#367;. (Obr&aacute;zek v kapitole &ldquo;Indoor by saerdnaer&rdquo;)</li>
<li>Existence patra je implicitn&#283; p&#345;edpokl&aacute;dan&aacute;, kdykoliv se v n&#283;m vyskytuje libovoln&yacute; prvek. Nen&iacute; tedy nutn&eacute; v&#382;dy vytv&aacute;&#345;et budovu ani patro. Naopak, v p&#345;&iacute;pad&#283; pot&#345;eby zazna&#269;en&iacute; v&iacute;ce informac&iacute; k patru, vyu&#382;&iacute;v&aacute;me obrys indoor=level&nbsp;s tagy ref=*, name=*, height=*&nbsp;atd.</li>
<li>Ka&#382;d&yacute; prvek pro indoor mus&iacute; m&iacute;t tag level=*. V syntaxi umo&#382;&#328;ujeme rozsah (0-2) pro rozp&#283;t&iacute; prvku p&#345;es v&iacute;ce pater, nap&#345;. v&yacute;tahov&aacute; &scaron;achta. Takov&yacute; prvek se pak nach&aacute;z&iacute; v cel&eacute;m intervalu, tedy i v p&#345;&iacute;padn&yacute;ch desetinn&yacute;ch mezipatrech. D&#345;&iacute;ve vyu&#382;&iacute;van&yacute; v&yacute;&#269;et (0;1;2) se nedoporu&#269;uje, ale z d&#367;vodu zp&#283;tn&eacute; kompatibility ho interpretujeme jako diskr&eacute;tn&iacute; hodnoty.</li>
<li>Nav&iacute;c ka&#382;d&yacute; prvek m&#367;&#382;e m&iacute;t tag repeat_on=*, kter&yacute; zna&#269;&iacute; jeho p&#345;esn&eacute; opakov&aacute;n&iacute; v jin&yacute;ch patrech, v&#269;etn&#283; nastaven&eacute;ho rozp&#283;t&iacute;. (Viz obr&aacute;zek.) Syntaxe je doporu&#269;en&aacute; v&yacute;&#269;tem (0;1;2). Vyu&#382;it&iacute; rozsahu (0-2) je mo&#382;n&eacute;, ale znamen&aacute; opakov&aacute;n&iacute; ve v&scaron;ech patrech od minima s &ldquo;n&aacute;sobky jedni&#269;ky&rdquo;. Tedy repeat_on=0.5-3&nbsp; je ekvivalentn&iacute; repeat_on=0.5;1.5;2.5.</li>
<li>Rozsahy jsou pro oba tagy mo&#382;n&eacute; i v z&aacute;porn&yacute;ch &#269;&iacute;slech, nap&#345;. level=-1-5, &#269;i pro ob&#283; z&aacute;porn&aacute; &#269;&iacute;sla level=-4--1, v&#382;dy ov&scaron;em tak, &#382;e prvn&iacute; hodnota je men&scaron;&iacute; ne&#382; druh&aacute;.</li>
<li>P&#345;&iacute;zemn&iacute; patro nen&iacute; vy&#382;adov&aacute;no &ndash; &#269;&iacute;slov&aacute;n&iacute; je d&aacute;no &#269;&iacute;seln&yacute;m ozna&#269;en&iacute;m v budov&#283;. Pro routing pak m&aacute; v&yacute;znam informace,&nbsp;ve kter&eacute;m pat&#345;e je uzel entrance=main&nbsp;napojen&yacute; na venkovn&iacute; cesty.</li>

</ul>
<h4>M&iacute;stnosti a chodby</h4>

<ul>
<li>Chodby je nov&#283; mo&#382;n&eacute; tagovat jako klasickou cestu highway=footway. Pova&#382;ujeme toti&#382; za z&aacute;sadn&iacute; dodr&#382;ovat filozofii OSM &ndash; mapovat od jednoduch&eacute;ho k p&#345;esn&#283;j&scaron;&iacute;mu. V tomto je Simple Indoor p&#345;&iacute;li&scaron; d&#367;kladn&yacute; a rovnou nut&iacute; tvo&#345;it plo&scaron;n&eacute; vnit&#345;n&iacute; prostory. </li>
<li>Krom&#283; chodeb se &#269;asto vyskytuj&iacute; i jak&aacute;si n&aacute;dvo&#345;&iacute; &#269;i atria. Ty je vhodn&eacute; otagovat plo&scaron;nou komunikac&iacute;,&nbsp;jak je v OSM zvykem; highway=footway&nbsp;+ area=yes. </li>
<li>Navrhujeme odd&#283;lit prim&aacute;rn&#283;&nbsp;pr&#367;choz&iacute; oblasti (chodby), kter&eacute; budou zna&#269;eny standardn&iacute; komunikac&iacute;, a prim&aacute;rn&#283; nepr&#367;choz&iacute; (m&iacute;stnosti), kter&eacute; budou zna&#269;eny indoor=*&nbsp;prvky dle Simple Indoor.</li>
<li>M&iacute;stnosti je mo&#382;n&eacute; zna&#269;it jako uzly nebo jako plochy pomoc&iacute; indoor=*&nbsp;&#269;i t&#345;eba pouze dve&#345;e door=yes. Op&#283;t dle filozofie od jednoduch&eacute;ho k p&#345;esn&#283;j&scaron;&iacute;mu. Dle mo&#382;nost&iacute; je vhodn&eacute; doplnit tag ref=*&nbsp;&#269;i name=*.</li>
<li>Schody navrhujeme zna&#269;it standardn&#283; highway=steps, typicky s rozsahem p&#345;es v&iacute;ce pater level=0-1. Aby se ur&#269;ilo, kde je za&#269;&aacute;tek a konec, navrhujeme vyu&#382;&iacute;t orientace cesty s t&iacute;m, &#382;e sm&#283;r povede od ni&#382;&scaron;&iacute;ho patra k vy&scaron;&scaron;&iacute;mu &ndash; tedy &scaron;ipka m&iacute;&#345;&iacute; do kopce. Tot&eacute;&#382; plat&iacute; pro libovoln&eacute; cesty, kter&eacute; jsou vedeny p&#345;es v&iacute;ce pater. </li>

</ul>
<h4>Shrnut&iacute;</h4>
<p>D&iacute;ky zjednodu&scaron;en&iacute; je mo&#382;n&eacute; vyu&#382;&iacute;vat v&scaron;echny prvky b&#283;&#382;n&eacute; v OSM sv&#283;t&#283;, pouze s p&#345;id&aacute;n&iacute;m tagu level=*. Obrysy budovy jsou vhodn&eacute; pro zobrazen&iacute; ve webov&yacute;ch map&aacute;ch a umo&#382;&#328;uj&iacute; i navigaci a geocoding v budov&#283;. Zachov&aacute;na je i kompatibilita s metodikou Simple 3D.</p>
<p>Pro konzumenta dat sta&#269;&iacute; v OSM hledat v&scaron;echny prvky s tagem level=*&nbsp;a min/max_level=*, n&aacute;sledn&#283; u&#382; je mo&#382;n&eacute; vytvo&#345;it u&#382;ivatelsky p&#345;&iacute;v&#283;tiv&yacute; p&#345;ep&iacute;na&#269; pater a zobrazovat jen relevantn&iacute; data. Zde podot&yacute;k&aacute;me, &#382;e indoor prohl&iacute;&#382;e&#269;e z principu mus&iacute; fungovat na vektorov&yacute;ch datech, nebo&#357; vy&#382;aduj&iacute; vykreslov&aacute;n&iacute; v prohl&iacute;&#382;e&#269;i. Adepti na vektorov&eacute; prohl&iacute;&#382;e&#269;e jsou technologie Mapbox GL, OSMBuildings JSON &#269;i mobiln&iacute; aplikace typu Maps.me a Osmand.</p>
<p>Klasick&eacute; 2D mapy jsou v&#283;t&scaron;inou p&#345;edgenerovan&eacute; obr&aacute;zkov&eacute; dla&#382;dice. D&iacute;ky vyu&#382;&iacute;v&aacute;n&iacute; tag&#367; b&#283;&#382;n&yacute;ch komunikac&iacute; jsou ov&scaron;em tyto vykresleny, a tak je v&#283;t&scaron;inou zachov&aacute;na informa&#269;n&iacute; hodnota i pro n&#283;.</p>
<p>Editory pro toto sch&eacute;ma zat&iacute;m neexistuj&iacute; a vyu&#382;&iacute;v&aacute;n&iacute; rozsah&#367; v tagu level=*&nbsp;n&aacute;m br&aacute;n&iacute; snadno editovat v editoru JOSM (na rozd&iacute;l od relac&iacute;). Je tedy vhodn&eacute; upravit st&aacute;vaj&iacute;c&iacute; editory, aby sch&eacute;ma podporovaly. &Uacute;prav&#283; iD se v&#283;nujeme v dal&scaron;&iacute; kapitole.</p>
<p><img></p>
<p>Obr&aacute;zek210: Zobrazen&iacute; otagovan&eacute;ho patra 13 v budov&#283; &#268;VUT (editor JOSM)</p>
<h2>2.4. 3D</h2>
<p>V ned&aacute;vn&eacute; dob&#283; tak&eacute; vznikla metodika pro vytv&aacute;&#345;en&iacute; 3D objekt&#367; nad OSM. Jednotliv&yacute;m ploch&aacute;m p&#345;i&#345;azuje mohutnost a v&yacute;&scaron;ku um&iacute;st&#283;n&iacute; nad povrchem. Nav&iacute;c lze ur&#269;it i vlastnosti jako barvu, typ st&#345;echy, materi&aacute;l apod. V praxi lze takto modelovat i slo&#382;it&eacute; objekty, ov&scaron;em nev&yacute;hodou je velk&eacute; mno&#382;stv&iacute; ploch, kter&eacute; mus&iacute; b&yacute;t do datab&aacute;ze OSM p&#345;id&aacute;no.</p>
<p>Zobrazen&iacute; v prohl&iacute;&#382;e&#269;i technologi&iacute; WebGL se v&#283;nuje open-source projekt <a>osmbuildings.com</a>&nbsp;a komer&#269;n&iacute; projekt <a>f4map.com</a>.</p>

<p><img></p>
<p>Obr&aacute;zek211: Zobrazen&iacute; &#381;i&#382;kovsk&eacute;ho vys&iacute;la&#269;e v 3D prohl&iacute;&#382;e&#269;i OSMBuildings</p>


<hr>
<h1>3. &Uacute;prava editoru iD</h1>
<p>V p&#345;edchoz&iacute; kapitole jsme polo&#382;ili d&#367;kladn&yacute; &uacute;vod do architektury OSM, shrnuli p&#345;edchoz&iacute; n&aacute;vrhy&nbsp;a navrhli novou metodiku pro indoor mapy. Tato kapitola pojedn&aacute;v&aacute; o implementaci t&eacute;to metodiky do editoru iD. Bylo t&#345;eba nastudovat pokro&#269;ilou knihovnu d3.js, velmi sporou dokumentaci iD-core a pochopit jeho fungov&aacute;n&iacute; z k&oacute;du a debugingu. Po n&aacute;vrhu u&#382;ivatelsk&eacute;ho rozhran&iacute; mohla za&#269;&iacute;t implementace v podob&#283; p&#345;id&aacute;n&iacute; ovl&aacute;dac&iacute;ch prvk&#367; pro indoor m&oacute;d a &uacute;pravy vykreslovac&iacute;ho enginu. Nakonec bylo mo&#382;n&eacute; sepsat pull request&nbsp;do GitHub reposit&aacute;&#345;e tohoto projektu a zasadit se o jeho za&#269;len&#283;n&iacute;. </p>
<h2>3.1. Popis editoru a technologi&iacute;</h2>
<p>O editoru jsme se ji&#382; rozepsali&nbsp;v kapitole 2.2. Shr&#328;me nyn&iacute;, &#382;e se jedn&aacute; o webov&yacute; editor postaven&yacute; na n&#283;kolika technologi&iacute;ch z rodiny HTML5. C&iacute;l&iacute; na za&#269;&aacute;te&#269;nickou skupinu u&#382;ivatel&#367;,&nbsp;a proto m&aacute; propracovan&eacute; jednoduch&eacute; u&#382;ivatelsk&eacute; rozhran&iacute;. Integra&#269;n&iacute; a jednotkov&eacute; testy jsou postaven&eacute; na frameworku Mocha.</p>
<p>Pro &uacute;pravu bude z&aacute;sadn&iacute; vlastnost t&eacute;&#382; filtrov&aacute;n&iacute; zobrazen&yacute;ch prvk&#367; dle kategori&iacute;, tzv. Features.</p>
<h3>3.1.1. Vizualiza&#269;n&iacute; knihovna d3.js </h3>
<p>Knihovna Data-Driven Documents (<a>d3js.org</a>) se zab&yacute;v&aacute; nav&aacute;z&aacute;n&iacute;m datov&yacute;ch pol&iacute; (arrays) na objektov&yacute; model HTML dokumentu (DOM). Pro p&#345;&iacute;d&aacute;n&iacute; a odebr&aacute;n&iacute; prvk&#367; do pole definuje enter &amp; exit transitions, kter&eacute; deklarativn&#283; ur&#269;uj&iacute;,&nbsp;co se p&#345;i dan&eacute; operaci&nbsp;d&#283;je. Dokumentace knihovny je d&#367;kladn&aacute; a d&iacute;ky sv&eacute; obl&iacute;benosti lze naj&iacute;t i mnoho dal&scaron;&iacute;ch zdroj&#367;.</p>
<p>API knihovny je podobn&eacute; zn&aacute;m&eacute;mu jQuery, bez nav&aacute;z&aacute;n&iacute; dat m&#367;&#382;eme &#345;&iacute;ci, &#382;e toto&#382;n&eacute;. Zde selektor a muta&#269;n&iacute; funkce:</p>
<p>d3.selectAll(&quot;p&quot;).text(&quot;Hello&quot;)</p>
<p>S&iacute;la knihovny se uk&aacute;&#382;e p&#345;i nav&aacute;z&aacute;n&iacute; dat, n&aacute;sledn&#283; toti&#382; m&#367;&#382;eme do muta&#269;n&iacute;ch funkc&iacute; m&iacute;sto hodnot uv&aacute;d&#283;t funkce. P&#345;i zm&#283;n&#283; dat na stejn&eacute;m selektoru se pak automaticky provedou operace za enter()&nbsp;funkc&iacute;, zde p&#345;id&aacute;n&iacute; odstavce a nastaven&iacute; jeho textu dle datov&eacute; hodnoty.</p>
<p>d3.select(&quot;body&quot;).selectAll(&quot;p&quot;)<br> &nbsp; &nbsp;.data([4, 8, 15, 16, 23, 42])<br> &nbsp; &nbsp;.enter().append(&quot;p&quot;)<br> &nbsp; &nbsp; .text(d&nbsp;=&gt;&nbsp;`I&rsquo;m number ${d}!`)</p>
<p>Z&aacute;klad je tedy jednoduch&yacute;, ale pro z&aacute;pis animac&iacute; a slo&#382;it&#283;j&scaron;&iacute;ch vno&#345;en&yacute;ch struktur vy&#382;aduje jist&yacute; cvik. Abstrakce objektov&eacute;ho modelu jako data je velmi u&#382;ite&#269;n&aacute; a hod&iacute; se nejen pro vykreslen&iacute; dat v map&#283;, ale i n&#283;kter&yacute;ch ovl&aacute;dac&iacute;ch prvk&#367;.</p>
<h3>3.1.2. Architektura iD</h3>
<p>Auto&#345;i na po&#269;&aacute;tku zvolili<sup><a>[53]</a></sup>&nbsp;vykreslov&aacute;n&iacute; dat pomoc&iacute; inline SVG &ndash; z&aacute;pis vektorov&eacute; grafiky&nbsp;pomoc&iacute; XML, kter&eacute; je mo&#382;n&eacute; p&#345;&iacute;mo inline&nbsp;vlo&#382;it do HTML DOM. Velkou v&yacute;hodou pak je, &#382;e SVG DOM generuje ud&aacute;losti jako HTML objekty, lze ho stylovat pomoc&iacute; klasick&yacute;ch selektor&#367; CSS3 a lze ho pochopiteln&#283; vytv&aacute;&#345;et stejn&#283; jako HTML DOM. P&#345;esn&#283; tyto v&yacute;hody daly za vznik i knihovn&#283; d3.js pro abstrakci vizualizac&iacute; nejen nad SVG.</p>
<p>Druh&aacute; mo&#382;nost by byla pou&#382;&iacute;vat tzv. HTML canvas, jeho&#382; vykreslen&iacute; je mnohokr&aacute;t rychlej&scaron;&iacute;, nen&aacute;ro&#269;n&eacute; na pam&#283;&#357; a podporovan&eacute; i star&scaron;&iacute;mi prohl&iacute;&#382;e&#269;i. Ov&scaron;em v tu chv&iacute;li by auto&#345;i museli programovat v&scaron;echny v&#283;ci ohledn&#283; grafick&eacute;ho enginu sami. S SVG naopak vyu&#382;ili grafick&eacute; j&aacute;dro prohl&iacute;&#382;e&#269;e. Volba padla zejm&eacute;na pro v&#283;t&scaron;&iacute; flexibilitu a snadn&#283;j&scaron;&iacute; v&yacute;voj.</p>
<p>Krom&#283; samotn&eacute; knihovny d3.js vyu&#382;&iacute;v&aacute; iD i n&#283;kolika roz&scaron;&iacute;&#345;en&iacute;: d3.xhr()&nbsp;pro pos&iacute;l&aacute;n&iacute; AJAX po&#382;adavk&#367;, d3.dispatch()&nbsp;pro vol&aacute;n&iacute; callback funkc&iacute; dle n&aacute;vrhov&eacute;ho vzoru observer<sup><a>[54]</a></sup>, d3.geo.path()&nbsp;pro generov&aacute;n&iacute; SVG linek dle sou&#345;adnic&iacute; a zadan&eacute; projekce a d3.behavior.zoom()&nbsp;pro zoomov&aacute;n&iacute; a posouv&aacute;n&iacute; mapy pomoc&iacute; CSS3 transformac&iacute;.</p>
<h3>3.1.3. Core architektura</h3>
<p>J&aacute;dro editoru se t&yacute;k&aacute; zejm&eacute;na datov&eacute;ho modelu postaven&eacute;ho nad OSM XML API. Vyu&#382;&iacute;v&aacute; n&#283;kolik velmi hezk&yacute;ch vlastnost&iacute; a je velmi d&#367;kladn&#283; otestov&aacute;no.</p>
<p>Entity odpov&iacute;daj&iacute; z&aacute;kladn&iacute;m prvk&#367;m OSM: iD.Node, iD.Way&nbsp;a iD.Relation. Jako jedin&eacute; v projektu vyu&#382;&iacute;vaj&iacute; d&#283;di&#269;nosti, a to od iD.Entity. Lze tak p&#345;istupovat k vlastnostem ID, tags a dal&scaron;&iacute;m dle typu. D&iacute;ky odli&scaron;n&eacute;mu jmenn&eacute;mu prostoru pro identifik&aacute;tory OSM typ&#367; zav&aacute;d&iacute; jednotn&yacute; jmenn&yacute; prostor identifik&aacute;tor&#367;, kde prefixuje &#269;&iacute;seln&eacute; ID prvn&iacute;m p&iacute;smenem typu, nap&#345;. n123, w42, r30.</p>
<p>Velmi chyt&#345;e navr&#382;enou &#269;&aacute;st&iacute; je implementace historie; podob&aacute; se verzovac&iacute;mu syst&eacute;mu Git. Ka&#382;d&aacute; entita je po vytvo&#345;en&iacute; nem&#283;nn&aacute; (immutable) &ndash; to znamen&aacute;, &#382;e tu konkr&eacute;tn&iacute; instanci objektu u&#382; nelze zm&#283;nit. Entity jsou sdru&#382;eny v nem&#283;nn&eacute;m grafu, kter&yacute; ukazuje na jednotliv&eacute; nem&#283;nn&eacute; objekty. P&#345;i &ldquo;&uacute;prav&#283;&rdquo; jedn&eacute; entity je tak vlastn&#283; vytvo&#345;ena nov&aacute; entita s upraven&yacute;mi vlastnostmi a vytvo&#345;en nov&yacute; graf, kter&yacute; ukazuje na v&scaron;echny p&#367;vodn&iacute; entity a jednu novou. </p>
<p>Graf tedy odpov&iacute;d&aacute; Git stromu a entity jednotliv&yacute;m Git objekt&#367;m. Tato implementace je velmi &scaron;ikovn&aacute; na funkci &bdquo;zp&#283;t&ldquo; (undo) a nab&iacute;z&iacute; dobrou abstrakci.</p>
<p><img></p>
<p>Obr&aacute;zek31: Historie a graf jako nem&#283;nn&yacute; objekt<sup><a>[55]</a></sup></p>
<p>Datov&yacute; model nab&iacute;z&iacute; n&#283;kolik dal&scaron;&iacute;ch &scaron;ikovn&yacute;ch funkc&iacute;:</p>

<ul>
<li>iD.Difference(g1,g2)&nbsp;&ndash; vrac&iacute; zm&#283;n&#283;n&eacute; prvky mezi dv&#283;ma grafy, co&#382; je pot&#345;ebn&eacute; pro vykreslen&iacute; zm&#283;n.</li>
<li>iD.Tree(g)&nbsp;&ndash; obal&iacute; dan&yacute; graf datovou strukturou R-tree a n&aacute;sledn&#283; um&iacute; efektivn&#283; vr&aacute;tit entity ve zvoln&eacute;m sou&#345;adnicov&eacute;m r&aacute;me&#269;ku BBOX. Slo&#382;itost vyhled&aacute;n&iacute; je O(logMn), maxim&aacute;ln&iacute; po&#269;et list&#367; byl zvolen M=9. <br>P&#345;&iacute;klad: var&nbsp;features =&nbsp;tree.intersects(iD.geo.Extent([0, 0], [2, 2]), tree.graph());</li>
<li>iD.Action()&nbsp;&ndash; abstrakce nad v&iacute;ce operacemi na grafu; vytv&aacute;&#345;&iacute; nov&yacute; graf, kter&yacute; ulo&#382;&iacute; do historie. Nap&#345;. p&#345;i smaz&aacute;n&iacute; cesty se odeberou i v&scaron;echny jej&iacute; uzly. iD.Operation()&nbsp;pak abstrahuje akci na operaci proveditelnou tla&#269;&iacute;tkem &#269;i kl&aacute;vesovou zkratkou a hl&iacute;d&aacute;, jestli je mo&#382;n&eacute; v danou chv&iacute;li akci prov&eacute;st.</li>
<li>iD.Mode(), iD.Behaviour()&nbsp;&ndash; z&aacute;kladn&iacute; m&oacute;d je prohl&iacute;&#382;en&iacute; mapy a tla&#269;&iacute;tky je mo&#382;n&eacute; zvolit t&#345;i m&oacute;dy pro p&#345;id&aacute;v&aacute;n&iacute; uzl&#367;, cest a ploch. M&oacute;dy definuj&iacute; chov&aacute;n&iacute; jako nap&#345;&iacute;klad zv&yacute;razn&#283;n&iacute; po najet&iacute; my&scaron;&iacute; na prvek, apod. (Pozn&aacute;mka: vyv&iacute;jen&yacute; Indoor m&oacute;d nen&iacute; m&oacute;dem v tomto &ldquo;core&rdquo; smyslu)</li>
<li>Samotn&eacute; vykreslov&aacute;n&iacute; SVG zaji&scaron;&#357;uje iD.Map, kter&aacute; implementuje p&#345;&iacute;slu&scaron;n&eacute;: iD.svg.Points, iD.svg.Vertices, iD.svg.Lines&nbsp;a iD.svg.Areas.</li>

</ul>
<h2>3.2. N&aacute;vrh u&#382;ivatelsk&eacute;ho rozhran&iacute;</h2>
<h3>3.2.1. Prvn&iacute; iterace</h3>
<p>U&#382;ivatelsk&eacute; rozhran&iacute; bylo t&#345;eba vyv&iacute;jet v n&#283;kolika iterac&iacute;ch a v&yacute;sledky testovat. Prvn&iacute; lo-fi prototyp byl proveden na pap&iacute;&#345;e a zde je prezentov&aacute;n pomoc&iacute; softwaru Blasamiq Mockups TODOobr32.</p>
<p><img></p>
<p>Obr&aacute;zek32: Prvn&iacute; n&aacute;vrh u&#382;ivatelsk&eacute;ho rozhran&iacute; v&#269;etn&#283; popisu interakc&iacute;</p>
<p>N&aacute;sledn&#283; prob&#283;hlo n&#283;kolik diskus&iacute; a test&#367; a rozhodli jsme se n&aacute;vrh p&#345;ehodnotit.</p>
<h3>3.2.2. Druh&aacute; iterace</h3>
<p>Pro u&#382;ivatele by byla&nbsp;ne&scaron;ikovn&aacute; nutnost vybrat budovu, a&#269;koliv to je implementa&#269;n&#283; snaz&scaron;&iacute; (p&#345;ep&iacute;na&#269; pater nab&iacute;z&iacute; pouze patra pro konkr&eacute;tn&iacute; budovu). Nav&iacute;c v na&scaron;&iacute; metodice umo&#382;&#328;ujeme tvorbu level=*&nbsp;prvk&#367; i bez ohrani&#269;uj&iacute;c&iacute; budovy, co&#382; by se muselo adaptovat.</p>

<ul>
<li>Tla&#269;&iacute;tko se tedy bude jmenovat &ldquo;Indoor m&oacute;d&rdquo; a bude se ukazovat v&#382;dy p&#345;i vybran&eacute; budov&#283; &#269;i prvku s level=*. Indoor m&oacute;d se zapne p&#345;esn&#283; do patra vybran&eacute;ho prvku. </li>
<li>P&#345;ep&iacute;na&#269; pater bude aktivn&iacute; nap&#345;&iacute;&#269; celou aplikac&iacute; &ndash; to tak&eacute; intuitivn&#283; odpov&iacute;d&aacute; um&iacute;st&#283;n&iacute; v z&aacute;hlav&iacute;, nikoliv u zvolen&eacute;ho prvku. Nab&iacute;zet se tedy budou v&scaron;echna dostupn&aacute; patra ve v&yacute;&#345;ezu.</li>
<li>V indoor m&oacute;du se nyn&iacute; schovaj&iacute; v&scaron;echny nesouvisej&iacute;c&iacute; prvky, aby u&#382;ivatel v&#283;d&#283;l,&nbsp;&#269;eho se t&yacute;k&aacute; jeho editace.</li>
<li>Vyzna&#269;en&iacute; plochy budovy bylo roz&scaron;&iacute;&#345;eno i vn&#283;, aby ji bylo mo&#382;n&eacute; vybrat p&#345;i pln&eacute;m pokryt&iacute; indoor plochami.</li>

</ul>
<p><img></p>
<p>Obr&aacute;zek33: Upraven&yacute; editor po druh&eacute; iteraci a zobrazen&eacute; operace</p>

<p><img></p>
<p><img></p>
<p>Obr&aacute;zek34ab: Fin&aacute;ln&iacute; editor po &#269;tvrt&eacute; iteraci&nbsp;v pat&#345;e 0 (a); a v pat&#345;e -1 (b)</p>

<h3>3.2.3. T&#345;et&iacute; a &#269;tvrt&aacute; iterace</h3>
<p>Pro jednoduchost shrnujeme v&yacute;sledky a obr&aacute;zek po obou iterac&iacute;ch, a tedy n&aacute;&scaron; z&aacute;v&#283;re&#269;n&yacute; editor. V&iacute;ce obr&aacute;zk&#367; je k dispozici v dal&scaron;&iacute; kapitole.</p>

<ol>
<li>Pro u&#382;ivatele bylo matouc&iacute; skryt&iacute; v&scaron;ech okoln&iacute;ch prvk&#367;, ponechali jsme tedy v&scaron;echny komunikace.</li>
<li>Aktivn&iacute; ortofoto vrstvu jsme pouze utlumili, stejn&#283; tak v&scaron;echny komunikace bez level=*. P&#345;i p&#345;echodu do z&aacute;porn&yacute;ch pater je pak oboj&iacute; utlumeno podstatn&#283; v&iacute;ce.</li>
<li>Pro lep&scaron;&iacute; vn&iacute;m&aacute;n&iacute; v&yacute;&scaron;ky zobrazujeme jen ty budovy, kter&eacute; maj&iacute; p&#345;&iacute;slu&scaron;n&aacute; patra (building:levels=*). Budovy s min/max_level=*&nbsp;jsou nav&iacute;c zv&yacute;razn&#283;n&eacute;, aby u&#382;ivatel poznal, &#382;e do nich m&#367;&#382;e mapovat.</li>
<li>P&#345;ep&iacute;na&#269;i pater jsme p&#345;idali tla&#269;&iacute;tka pro zv&yacute;&scaron;en&iacute; a sn&iacute;&#382;en&iacute; patra o jedni&#269;ku. Tla&#269;&iacute;tka jsme zv&#283;t&scaron;ili a um&iacute;stili vedle sebe, proto&#382;e mus&iacute; b&yacute;t dostupn&aacute;, kv&#367;li &#269;ast&eacute;mu pou&#382;&iacute;v&aacute;n&iacute;. Pro editor je tento p&#345;&iacute;stup p&#345;irozen&#283;j&scaron;&iacute; ne&#382; v&yacute;b&#283;r z existuj&iacute;c&iacute;ch&nbsp;pater, proto&#382;e p&#345;irozen&#283; vede u&#382;ivatele k tomu, aby v nov&eacute;m pat&#345;e za&#269;al tvo&#345;it.</li>
<li>Ploch&aacute;m indoor=corridor&nbsp;a indoor=area, tedy t&#283;m beze st&#283;n, jsme zeslabili ohrani&#269;en&iacute;, nebo&#357; siln&#283;j&scaron;&iacute; ohrani&#269;en&iacute; evokuje st&#283;nu.</li>
<li>Informaci o zvolen&eacute;m pat&#345;e jsme p&#345;idali do URL, pro mo&#382;nost odkazov&aacute;n&iacute; na konkr&eacute;tn&iacute; patro v indoor m&oacute;du.</li>

</ol>
<p>&#268;tvrt&aacute; iterace se t&yacute;kala pouze drobn&yacute;ch &uacute;prav p&#345;ep&iacute;na&#269;e.</p>

<ol>
<li>Tla&#269;&iacute;tka pro zv&yacute;&scaron;en&iacute; a sn&iacute;&#382;en&iacute; patra jdou p&#345;es desetinn&aacute; patra, v p&#345;&iacute;pad&#283;, &#382;e takov&aacute; existuj&iacute;.</li>
<li>V nab&iacute;dce comboboxu&nbsp;se zobrazuj&iacute; pouze ta patra, kter&aacute; jsou explicitn&#283; definovan&aacute; v tagu level=*. Pom&aacute;h&aacute; to u&#382;ivateli ve zji&scaron;t&#283;n&iacute;, kter&aacute; patra jsou zmapovan&aacute;.</li>

</ol>
<h2>3.3. Implementace</h2>
<p>Bylo pot&#345;eba p&#345;idat ovl&aacute;dac&iacute; prvek pro aktivaci Indoor m&oacute;du a n&aacute;slednou volbu patra. D&aacute;le pak zajistit skryt&iacute; prvk&#367; v jin&yacute;ch patrech.</p>
<p>Nejd&#345;&iacute;ve se zd&aacute;lo vhodn&eacute; upravit t&#345;&iacute;du iD.map&nbsp;v m&iacute;st&#283;, kde pos&iacute;l&aacute; v&scaron;echny entity k filtrov&aacute;n&iacute; Features a d&aacute;l k &nbsp;vykreslen&iacute; SVG:</p>
<p>xjscode<br>if (context.indoorMode()) {<br> &nbsp; data = data.filter(function (entity) {<br> &nbsp; &nbsp; &nbsp; return inRange(context.indoorLevel(), entity.tags.level) || &hellip; ;<br> &nbsp; });<br>}<br>data = features.filter(data, graph); &nbsp; // filtrov&aacute;n&iacute; dle Features<br>svgSurface.call(drawVertices, graph, data, filter, map.extent(), map.zoom())...<br>xjscodeend</p>
<p>Ov&scaron;em z&aacute;hy se toto &#345;e&scaron;en&iacute; uk&aacute;zalo jako nevhodn&eacute;. Toto vol&aacute;n&iacute; se prov&aacute;d&iacute; velmi &#269;asto &ndash; p&#345;i ka&#382;d&eacute; ud&aacute;losti context.enter&nbsp;(vybr&aacute;n&iacute; prvku, &uacute;prava atd.), p&#345;i map.move&nbsp;(posun mapy tzv. debounced na 400 ms) a dal&scaron;&iacute;ch. Vykreslen&iacute; pomoc&iacute; d3.js je rychl&eacute; (vykresl&iacute; se jen DOM pro zm&#283;ny), Features vyu&#382;&iacute;v&aacute; cachov&aacute;n&iacute;. Ov&scaron;em n&aacute;&scaron; p&#345;&iacute;stup by p&#345;i ka&#382;d&eacute;m vol&aacute;n&iacute; musel naparsovat level=*&nbsp;tag pro v&scaron;echny prvky a zjistit, zda se nach&aacute;z&iacute; v rozsahu.</p>
<p>Bylo tedy t&#345;eba hledat jin&eacute; &#345;e&scaron;en&iacute;. To jsme na&scaron;li v podob&#283; ji&#382; funguj&iacute;c&iacute;ho filtrov&aacute;n&iacute; Features. Logika je pom&#283;rn&#283; slo&#382;it&aacute;, proto&#382;e krom&#283; skryt&iacute; prvk&#367; dle za&scaron;krtnut&yacute;ch kategori&iacute; se zde prov&aacute;d&iacute; i tzv. autohide. Ten automaticky skr&yacute;v&aacute; prvky v p&#345;&iacute;padech,&nbsp;kde by jich bylo p&#345;&iacute;li&scaron; mnoho na &#269;tvere&#269;n&iacute; jednotku. Nav&iacute;c jeden prvek m&#367;&#382;e pat&#345;it i do v&iacute;ce kategori&iacute; a je skryt,&nbsp;pokud je skryta alespo&#328; jedna z nich.</p>
<p>Definovali jsme tedy kategorii indoor&nbsp;a indoor_different_level, kterou bylo t&#345;eba p&#345;i zapnut&iacute; indoor m&oacute;du automaticky schovat:</p>
<p>xjscode2<br>defineFeature(&#39;indoor&#39;, function isIndoorOther(entity) {<br> &nbsp; return !!entity.tags.level;<br>});<br>defineFeature(&#39;indoor_different_level&#39;, function isHiddenByLevel(entity, resolver, geometry) {<br> &nbsp; &nbsp; return inRange(context.indoorLevel(), entity.tags.level) || &hellip; ;<br>});<br>xjscode2end</p>
<p>T&iacute;m jsme vyu&#382;ili mnoho st&aacute;vaj&iacute;c&iacute; logiky a z&aacute;rove&#328; p&#345;i vstupu do Indoor m&oacute;du mohli i p&#345;irozen&#283; vypnout ne&#382;&aacute;douc&iacute; Features.</p>
<p>N&aacute;sledn&#283; bylo t&#345;eba spr&aacute;vn&eacute; vykreslen&iacute; uzl&#367; s vlastnostmi, skr&yacute;v&aacute;n&iacute; uzl&#367; v cest&#283; dle jej&iacute;ch vlastnost&iacute;, vynucen&iacute; skryt&iacute; i pro nov&#283; p&#345;idan&eacute; prvky a mnoho dal&scaron;&iacute; v&yacute;vojov&eacute; i ladic&iacute; pr&aacute;ce, kter&aacute; je dostupn&aacute; ve zdrojov&yacute;ch k&oacute;dech. </p>
<p>Pr&aacute;ci mimo j&aacute;dro (tedy vykreslovac&iacute; vzhledy, presets a dal&scaron;&iacute;) zde nerozepisujeme, nebo&#357; nen&iacute; tak technicky n&aacute;ro&#269;n&aacute; &ndash; popis se nach&aacute;z&iacute; v p&#345;edchoz&iacute; kapitole a samoz&#345;ejm&#283; je i k nahl&eacute;dnut&iacute; diff zdrojov&yacute;ch k&oacute;d&#367;.</p>
<h2>3.4. Za&#269;len&#283;n&iacute; do projektu iD</h2>
<p>Na&scaron;e &uacute;pravy prob&#283;hly na forku Git repozit&aacute;&#345;e. Po dokon&#269;en&iacute; t&#345;et&iacute; iterace byl zasl&aacute;n tzv. pull-request. Jedn&aacute; se o standardn&iacute; formu jak na GitHubu nab&iacute;dnout spr&aacute;vci n&#283;jak&eacute;ho projektu za&#269;len&#283;n&iacute; nov&eacute;ho k&oacute;du. </p>
<p>Pull request je k dispozici na adrese <a>https://github.com/openstreetmap/iD/pull/3097</a>&nbsp;a otisk ke stavu odevzd&aacute;n&iacute; v p&#345;&iacute;loze t&eacute;to pr&aacute;ce a na CD.</p>
<p>Hlavn&iacute; spr&aacute;vce projektu, Bryan Housel, na n&#283;j reagoval ve smyslu, &#382;e se mu pr&aacute;ce l&iacute;b&iacute; a r&aacute;d by ji&nbsp;do projektu v n&#283;jak&eacute; form&#283; za&#269;lenil. Ov&scaron;em nejd&#345;&iacute;ve bude t&#345;eba vymyslet,&nbsp;jak l&eacute;pe pojmout u&#382;ivatelsk&eacute; rozhran&iacute; &ndash; r&aacute;d by,&nbsp;aby tla&#269;&iacute;tko bylo dostupn&eacute; st&aacute;le, ale trochu m&eacute;n&#283; n&aacute;padn&eacute;.</p>
<p>Na dal&scaron;&iacute;m v&yacute;voji budeme spolupracovat i nad r&aacute;mec t&eacute;to diplomov&eacute; pr&aacute;ce.</p>
<p><img></p>
<p>Obr&aacute;zek35: Prvn&iacute; koment&aacute;&#345; spr&aacute;vce projektu<sup><a>[56]</a></sup></p>

<hr>
<h1>4. Vyu&#382;it&iacute; v&yacute;sledk&#367; pr&aacute;ce</h1>
<p>Vytvo&#345;en&iacute; dobr&eacute; metodiky a editoru pro indoor mapy v OSM jsou z&aacute;kladn&iacute; p&#345;edpoklady pro to, aby se toto odv&#283;tv&iacute; mohlo pln&#283; rozvinout. V t&eacute;to kapitole prezentujeme n&#283;kter&aacute; zmapovan&aacute;&nbsp;m&iacute;sta, navrhujeme indoor &#345;e&scaron;en&iacute; pro ve&#345;ejn&eacute; instituce a zam&yacute;&scaron;l&iacute;me se nad mo&#382;nou prezentac&iacute; indoor mapy.</p>
<h2>4.1. Zmapovan&aacute; m&iacute;sta</h2>
<p>Pro otestov&aacute;n&iacute; na&scaron;&iacute; v&yacute;sledn&eacute; metodiky jsme zmapovali,&nbsp;s hrub&yacute;mi detaily,&nbsp;vnit&#345;n&iacute; pl&aacute;n dvou budov &#268;VUT (TODO obr41a) a stanici metra Dejvick&aacute; (TODO obr43a). Tyto zm&#283;ny jsou k dispozici v datab&aacute;zi OSM a t&eacute;&#382; na p&#345;ilo&#382;en&eacute;m CD.</p>
<p>Mnoho m&iacute;st ji&#382; bylo zmapov&aacute;no pomoc&iacute; metodiky Simple Indoor Tagging. Seznam je k dispozici na str&aacute;nce metodiky\footnote{<a>http://wiki.osm.org/Simple_Indoor_Tagging</a>}&nbsp;a v prohl&iacute;&#382;e&#269;i OpenLevelUp\footnote{<a>http://openlevelup.net</a>}. D&iacute;ky kompatibilit&#283; obou metodik je mo&#382;n&eacute; tato m&iacute;sta prohl&iacute;&#382;et i v upraven&eacute;m editoru\footnote{K dispozici na str&aacute;nce <a>http://openstreetmap.cz/edit</a>}, kter&yacute; je v&yacute;sledkem t&eacute;to pr&aacute;ce.</p>
<p>Obr&aacute;zek41abc: Uk&aacute;zka zmapovan&eacute; stanice metra Dejvick&aacute; v pat&#345;e 0 (a), pat&#345;e -1 (b) a bez aktivovan&eacute;ho indoor m&oacute;du (c)</p>
<p>Obr&aacute;zek43abcd: Uk&aacute;zka z&aacute;kladn&iacute;ho zmapov&aacute;n&iacute; dvou budov &#268;VUT v pat&#345;e 0 (a) v pat&#345;e 0.5 (b) v pat&#345;e 1 (c) a v pat&#345;e 13 v&#269;etn&#283; vstup&#367; do m&iacute;stnost&iacute; (c)</p>
<h2>4.2. &#344;e&scaron;en&iacute; pro ve&#345;ejn&eacute; instituce</h2>
<p>Tato&nbsp;pr&aacute;ce m&#367;&#382;e v&yacute;znam&#283; pomoci orientaci n&aacute;v&scaron;t&#283;vn&iacute;k&#367; ve ve&#345;ejn&yacute;ch budov&aacute;ch, nap&#345;. &scaron;kol&aacute;ch, &uacute;&#345;adech&nbsp;&#269;i&nbsp;muze&iacute;. D&iacute;ky crowd-sourcingov&eacute; povaze OSM je jen ot&aacute;zkou &#269;asu, ne&#382; data p&#345;isp&#283;vatel&eacute; vytvo&#345;&iacute;. V&yacute;sledky pak budou k dispozici ve v&scaron;ech projektech, kter&eacute; na&scaron;i metodiku implementuj&iacute;. Krom&#283; celosv&#283;tov&eacute;ho webov&eacute;ho prohl&iacute;&#382;e&#269;e indoor map m&#367;&#382;e b&yacute;t roz&scaron;&iacute;&#345;ena i jedna z mobiln&iacute;ch aplikac&iacute;\footnote{nap&#345;. multiplatformn&iacute; aplikace maps.me &#269;i Osmand}, kter&eacute; zat&iacute;m zobrazuj&iacute; jen venkovn&iacute; mapy. </p>
<p>Pokud by ve&#345;ejn&aacute; instituce cht&#283;la b&yacute;t autoritativn&iacute;m zdrojem dat, je mo&#382;n&aacute; i varianta nasazen&iacute; vlastn&iacute; instance OSM datab&aacute;ze pouze pro tato data. D&iacute;ky tomu pak m&#367;&#382;e regulovat p&#345;&iacute;stup u&#382;ivatel&#367; i editace. V takov&eacute;m p&#345;&iacute;pad&#283; bychom velmi doporu&#269;ovali nastavit jednosm&#283;rn&yacute; export dat do OSM, aby data byla p&#345;&iacute;tomna i v glob&aacute;ln&iacute; datab&aacute;zi.</p>
<h2>4.3. Webov&yacute; prohl&iacute;&#382;e&#269; indoor map</h2>
<p>Jakmile jsou dostupn&aacute; data, nab&iacute;z&iacute; se mo&#382;nost za&#269;&iacute;t vytv&aacute;&#345;et vizualizace. V tomto sm&#283;ru navrhujeme pouze koncept webov&eacute;ho prohl&iacute;&#382;e&#269;e &ndash; viz obr&aacute;zek 4.3.</p>
<p><img></p>
<p>Obr&aacute;zek42: Koncept 3D prohl&iacute;&#382;e&#269;e &ndash; upraveno v grafick&eacute;m editoru</p>


<h1>5. Z&aacute;v&#283;r</h1>
<p>Problematika indoor map se uk&aacute;zala jako velk&eacute; t&eacute;ma dne&scaron;n&iacute; doby. Platforma OpenStreetMap v posledn&iacute;ch letech zaznamenala velk&yacute; rozmach, ale vhodn&yacute; n&aacute;vrh pro indoor mapov&aacute;n&iacute; dosud nebyl p&#345;ijat. &#344;e&scaron;en&iacute;, kter&eacute; je v&yacute;sledkem t&eacute;to pr&aacute;ce, m&aacute;&nbsp;potenci&aacute;l OSM vhodn&#283; roz&scaron;&iacute;&#345;it, a umo&#382;nit&nbsp;tak&nbsp;tvorbu celosv&#283;tov&eacute; indoor mapy spravovan&eacute; u&#382;ivateli. </p>
<p>V pr&aacute;ci se rozs&aacute;hle v&#283;nujeme problematice indoor map a geolokaci, shrnujeme v&yacute;voj v komer&#269;n&iacute; i open-sourcov&eacute; sf&eacute;&#345;e a ukazujeme i n&#283;kolik zaj&iacute;mav&yacute;ch projekt&#367; pro dal&scaron;&iacute; vyu&#382;it&iacute;. </p>
<p>Popsali jsme architekturu OpenStreetMap, se kterou m&aacute;me dlouholet&eacute; zku&scaron;enosti, pro&scaron;li a zhodnotili v&scaron;echny dosud zve&#345;ejn&#283;n&eacute; n&aacute;vrhy pro indoor&nbsp;a nakonec navrhli vlastn&iacute; metodiku. Vy&scaron;li jsme z aktu&aacute;ln&iacute;ho syst&eacute;mu Simple Indoor Tagging a navrhli n&#283;kter&aacute; zjednodu&scaron;en&iacute; pro snaz&scaron;&iacute; zad&aacute;v&aacute;n&iacute; u&#382;ivateli. Syst&eacute;m byl odzkou&scaron;en nejprve ve st&aacute;vaj&iacute;c&iacute;m editoru JOSM a pot&eacute; bylo namodelov&aacute;no n&#283;kolik p&#345;&iacute;pad&#367; v n&aacute;mi upraven&eacute;m editoru iD. Metodiku se chyst&aacute;me navrhnout jako ofici&aacute;ln&iacute; tagov&aacute;n&iacute; pro OSM.</p>
<p>Editor iD se uk&aacute;zal jako vhodn&yacute; kandid&aacute;t na dopln&#283;n&iacute; funkcionality. Popsali jsme jeho architekturu, navrhli a otestovali u&#382;ivatelsk&eacute; rozhran&iacute; a pokusili se o za&#269;len&#283;n&iacute; do distribuce. Spr&aacute;vce projektu na&scaron;i &uacute;pravu shledal s pozitivn&iacute;m ohlasem a chce spolupracovat na za&#269;len&#283;n&iacute;.</p>
<p>Nab&iacute;dli jsme &#345;e&scaron;en&iacute; vhodn&eacute; pro ve&#345;ejn&eacute; instituce a m&aacute;me v pl&aacute;nu dal&scaron;&iacute; rozvoj. Aktu&aacute;ln&#283; p&#345;ipravujeme spolupr&aacute;ci&nbsp;s &#268;VUT Navig&aacute;torem, a tak&eacute; s N&aacute;rodn&iacute;m muzeem, kter&eacute; v minulosti projevilo z&aacute;jem o indoor navigaci a lokalizaci pomoc&iacute; QR k&oacute;d&#367;.</p>


<h1>6. P&#345;&iacute;lohy:</h1>
<p>Pullrequesty a bugreporty v pr&#367;b&#283;hu pr&aacute;ce - jen zm&iacute;nit a odk&aacute;zat.</p>

<ul>
<li>id editor &uacute;pravy dokumentace install.md + faq.md</li>
<li>kendzi3d for josm - issue - volume rendering</li>
<li><a>https://github.com/rubyerme/chrome-github-mate/pull/18</a></li>

</ul>

<p>Vlo&#382;it jako PDF</p>

<ul>
<li><a>https://github.com/openstreetmap/iD/pull/3097</a>&nbsp;- jako PDFko</li>

</ul>

<hr><p><a>[1]</a>&nbsp;<a>http://archinect.com/news/article/61312195/google-maps-enters-the-indoor-gps-market</a>&nbsp;| Google Maps enters the indoor GPS market | Nov 13 &#39;12 | Archinect news</p>
<p><a>[2]</a>&nbsp;v&iacute;ce server&#367;: <a>http://www.patentlyapple.com/patently-apple/2014/08/apple-and-google-headed-for-an-indoor-location-services-war.html</a>&nbsp;<br><a>http://www.cultofmac.com/299653/apple-steps-fight-google-maps-indoor-directions/</a><br><a>http://www.citymetric.com/horizons/why-indoors-could-be-next-frontier-map-makers-1559</a>&nbsp;</p>
<p><a>[3]</a>&nbsp;<a>http://www.fsv.cvut.cz/svoc/2010/budova.jpg</a>&nbsp;| Orienta&#269;n&iacute; sch&eacute;ma budovy FSv | 2010 | Web FSv &#268;VUT</p>
<p><a>[4]</a>&nbsp; <a>http://www.fel.cvut.cz/en/glance/rooms.html</a>&nbsp;| Finding your way around our campus | ? | Web FEL &#268;VUT</p>
<p><a>[5]</a>&nbsp;<a>http://www.elsa.cvut.cz/_media/files/FA_WEB_Elsa_CVUT(1).pdf</a>&nbsp;ELSA &ndash; St&#345;edisko pro podporu student&#367; se specifick&yacute;mi pot&#345;ebami &#268;VUT, projekt Bezbari&eacute;rov&eacute; &#268;VUT, www.elsa.cvut.cz, Praha 2015</p>
<p><a>[6]</a>&nbsp;wikipedia/tomtom + <a>http://www.tomtom.com/en_za/licensing/products/maps/indoor-maps/</a>&nbsp;</p>
<p><a>[7]</a>&nbsp;<a>https://www.micello.com/company/our-story</a>&nbsp;</p>
<p><a>[8]</a>&nbsp;<a>https://en.wikipedia.org/w/index.php?title=Tele_Atlas&amp;oldid=713702420#Internet_mapping_agreements</a>&nbsp;</p>
<p><a>[9]</a>&nbsp;<a>https://company.here.com/here/</a>&nbsp;+ Here (company). (2016, April 24). In Wikipedia, The Free Encyclopedia. Retrieved 10:54, April 29, 2016, from <a>https://en.wikipedia.org/w/index.php?title=Here_(company)&amp;oldid=716846229</a>&nbsp;</p>
<p><a>[10]</a>&nbsp;<a>http://www.phonearena.com/news/NAVTEQ-launches-Destination-Maps-for-indoor-navigation_id17680</a>&nbsp;</p>
<p><a>[11]</a>&nbsp;<a>http://blogs.bing.com/maps/2011/03/22/bing-maps-venue-maps-now-feature-nine-largest-us-malls-148-total/</a>&nbsp;</p>
<p><a>[12]</a>&nbsp;<a>http://www.ubergizmo.com/2015/07/uber-loses-bid-for-nokia-here-maps-to-german-car-makers/</a>&nbsp;</p>
<p><a>[13]</a>&nbsp;<a>https://docs.google.com/spreadsheets/d/1NgoJHndqAJj8VWd9LQ89UDEsR59OMVecUwdl10rKul0/edit#gid=0</a>&nbsp;</p>
<p><a>[14]</a>&nbsp;<a>http://recode.net/2015/02/08/ten-years-of-google-maps-from-slashdot-to-ground-truth/</a>&nbsp;</p>
<p><a>[15]</a>&nbsp;<a>https://en.wikipedia.org/wiki/Google_Maps#Indoor_Google_Maps</a>&nbsp;</p>
<p><a>[16]</a>&nbsp;<a>https://www.google.com/maps/about/partners/indoormaps/</a>&nbsp;</p>
<p><a>[17]</a>&nbsp;<a>https://support.google.com/maps/answer/1685827</a>&nbsp;</p>
<p><a>[18]</a>&nbsp;<a>http://www.theverge.com/2015/11/2/9657304/apple-indoor-mapping-survey-app</a>&nbsp;</p>
<p><a>[19]</a>&nbsp;<a>http://applemapsmarketing.com/2015/08/apple-maps-finally-updates-satellite-imagery-for/</a>&nbsp;</p>
<p><a>[20]</a>&nbsp;<a>http://www.citymetric.com/horizons/why-indoors-could-be-next-frontier-map-makers-1559</a>&nbsp;</p>
<p><a>[21]</a>&nbsp;<a>https://www.micello.com/micello-and-indoors-partnership-announcement</a>&nbsp;</p>
<p><a>[22]</a>&nbsp;<a>https://www.micello.com/micello-and-eegeo-partnership-announcement</a>&nbsp;</p>
<p><a>[23]</a>&nbsp;<a>https://www.micello.com/coverage</a>&nbsp;+ &nbsp;<a>https://www.micello.com/map/130</a>&nbsp; + screenshoty z iphonu</p>
<p><a>[24]</a>&nbsp;bibtex citace J21 - <a>http://anyplace.cs.ucy.ac.cy/publications/</a>&nbsp;</p>
<p><a>[25]</a>&nbsp;<a>http://anyplace.cs.ucy.ac.cy/viewer/?buid=building_b02743d3-9338-4cf6-b689-0450985aff36_1461914709436</a>&nbsp;+ screenshoty + logger pro android google play</p>
<p><a>[26]</a>&nbsp;<a>http://anyplace.cs.ucy.ac.cy/developers/</a>&nbsp;</p>
<p><a>[27]</a>&nbsp;citace t&#283;ch n&#283;kolika BP/DP prac&iacute; </p>
<p><a>[28]</a>&nbsp;<a>http://www.i-locate.eu/fact-sheet/</a>&nbsp;&ndash; sekce Technical baseline</p>
<p><a>[29]</a>&nbsp;<a>http://www.opengeospatial.org/standards/indoorgml</a>&nbsp;</p>
<p><a>[30]</a>&nbsp;<a>http://www.i-locate.eu/the-josm-plugin-for-indoorgml-has-been-released-by-the-i-locate-consortium-2/</a>&nbsp;</p>
<p><a>[31]</a>&nbsp;<a>https://www.google.com/atap/project-tango/</a>&nbsp;</p>
<p><a>[32]</a>&nbsp;<a>http://www.theverge.com/2016/2/23/11094020/google-lenovo-project-tango-indoor-navigation</a>&nbsp;</p>
<p><a>[33]</a>&nbsp;<a>http://navigovat.mobilmania.cz/clanky/poradek-ve-zkratkach-co-znamena-a-gps/sc-265-a-1314495</a>&nbsp;</p>
<p><a>[34]</a>&nbsp;<a>https://en.wikipedia.org/wiki/Wi-Fi_positioning_system</a>&nbsp;</p>
<p><a>[35]</a>&nbsp;<a>https://www.indooratlas.com/faq/</a>&nbsp;</p>
<p><a>[36]</a>&nbsp;<a>https://en.wikipedia.org/wiki/Dead_reckoning</a>&nbsp;</p>
<p><a>[37]</a>&nbsp;<a>http://wiki.openstreetmap.org/wiki/Indoor_Mapping#Devices_.2F_Technologies</a>&nbsp;</p>
<p><a>[38]</a>&nbsp;<a>https://www.google.cz/search?q=sound%20fingerprint%20of%20room</a>&nbsp; &nbsp;-- vyberu jednotiv&eacute; pr&aacute;ce</p>
<p><a>[39]</a>&nbsp;<a>http://wiki.openstreetmap.org/wiki/Stats</a>&nbsp;</p>
<p><a>[40]</a>&nbsp;Tento text je voln&#283; p&#345;evzat z m&eacute;ho textu na <a>openstreetmap.cz/vyuziti</a>&nbsp;- autor Pavel Zbytovsk&yacute;, &uacute;nor 2016</p>
<p><a>[41]</a>&nbsp;screenshot <a>http://api.openstreetmap.org/api/0.6/map?bbox=14.304,50.099,14.306,50.1</a>&nbsp;+ JOSMu</p>
<p><a>[42]</a>&nbsp;<a>https://mapzen.com/data/metro-extracts/</a>&nbsp;</p>
<p><a>[43]</a>&nbsp;<a>https://download.geofabrik.de/</a>&nbsp;</p>
<p><a>[44]</a>&nbsp;<a>https://github.com/osmlab/editor-layer-index</a>&nbsp;</p>
<p><a>[45]</a>&nbsp;<a>https://blog.openstreetmap.org/2013/05/07/openstreetmap-launches-all-new-easy-map-editor-and-announces-funding-appeal/</a>&nbsp;</p>
<p><a>[46]</a>&nbsp;<a>http://wiki.openstreetmap.org/wiki/Challenges_for_Indoor_Maps</a>&nbsp;</p>
<p><a>[47]</a>&nbsp;obr&aacute;zky z <a>wiki.osm.org/Proposed_features/indoor</a></p>
<p><a>[48]</a>&nbsp;citace! &nbsp;<a>http://koenigstuhl.geog.uni-heidelberg.de/publications/2011/Goetz/Goetz-Zipf_2011_IndoorOSM.pdf</a>&nbsp;</p>
<p><a>[49]</a>&nbsp;obr&aacute;zek z relace <a>wiki.osm.org/IndoorOSM</a></p>
<p><a>[50]</a>&nbsp;<a>https://taginfo.openstreetmap.org/relations/building</a>&nbsp;</p>
<p><a>[51]</a>&nbsp;<a>http://wiki.openstreetmap.org/wiki/Simple_3D_buildings</a>&nbsp;</p>
<p><a>[52]</a>&nbsp;obrzaky <a>wiki.osm.org/Simple_Indoor_Tagging</a></p>
<p><a>[53]</a>&nbsp;<a>https://github.com/openstreetmap/iD/blob/master/ARCHITECTURE.md#core</a>&nbsp;</p>
<p><a>[54]</a>&nbsp;<a>https://en.wikipedia.org/wiki/Observer_pattern</a>&nbsp;</p>
<p><a>[55]</a>&nbsp;<a>https://github.com/openstreetmap/iD/blob/master/ARCHITECTURE.md</a>&nbsp;</p>
<p><a>[56]</a>&nbsp;screenshot pull request - J&aacute;</p>
</body></html>